<?php
include_once __DIR__."/getTaiwan4808CharList.php";
include_once __DIR__."/getKoCharList.php";
include_once __DIR__."/getHskV2CharList.php";
include_once __DIR__."/getHskV3CharList.php";
// radicals have been verified for all languages

// ja:
// g1 to g8 have been verified
// others (g9, gc ...) should be set only if verified

// ko:
// hanja8 to hanj1 and others (ku, kc ...) should be set only if verified
// hanja1800a and hanja1800b have not been verified

// zh-Hans:
// common7000 are verified
// others (uncommon, traditional, component ...) should be set only if verified

// zh-Hant
// t21 to t26 should be set only if verified
// taiwan4808 have not been verified

function getCharList($set)
{
	$a="";
	// ja
	if ($set=="hiragana")
	{
		$a.="あいうえおかきくけこさしすせそたちつてとなにぬねの";
		$a.="はひふへほまみむめもやゆよらりるれろわゐゑをん";
		$a.="ゔがぎぐげござじずぜぞだぢづでどばびぶべぼぱぴぷぺぽ";
		$a.="ぁぃぅぇぉゕゖっゃゅょゎ";
		//$a.="ゝゞゟ";
	}
	else if ($set=="katakana")
	{
		$a.="アイウエオカキクケコサシスセソタチツテトナニヌネノ";
		$a.="ハヒフヘホマミムメモヤユヨラリルレロワヰヱヲン";
		$a.="ヴガギグゲゴザジズゼゾダヂヅデドバビブベボパピプペポヷヸヹヺ";
		$a.="ァィゥェォヵヶッャュョヮー";
		//$a.="ヽヾ";
	}
	else if ($set=="g1")
	{
		$a.="一七三上下中九二五人";
		$a.="休先入八六円出力十千";
		$a.="口右名四土夕大天女子";
		$a.="字学小山川左年手文日";
		$a.="早月木本村林校森正気";
		$a.="水火犬玉王生田男町白";
		$a.="百目石空立竹糸耳花草";
		$a.="虫見貝赤足車金雨青音";
	}
	else if ($set=="g2")
	{
		$a.="万丸交京今会体何作元";
		$a.="兄光公内冬刀分切前北";
		$a.="午半南原友古台合同回";
		$a.="図国園地場声売夏外多";
		$a.="夜太妹姉室家寺少岩工";
		$a.="市帰広店弓引弟弱強当";
		$a.="形後心思戸才教数新方";
		$a.="明星春昼時晴曜書朝来";
		$a.="東楽歌止歩母毎毛池汽";
		$a.="活海点父牛理用画番直";
		$a.="矢知社秋科答算米紙細";
		$a.="組絵線羽考聞肉自船色";
		$a.="茶行西親角言計記話語";
		$a.="読谷買走近通週道遠里";
		$a.="野長門間雪雲電頭顔風";
		$a.="食首馬高魚鳥鳴麦黄黒";
	}
	else if ($set=="g3")
	{
		$a.="丁世両主乗予事仕他代";
		$a.="住使係倍全具写列助勉";
		$a.="動勝化区医去反取受号";
		$a.="向君味命和品員商問坂";
		$a.="夫始委守安定実客宮宿";
		$a.="寒対局屋岸島州帳平幸";
		$a.="度庫庭式役待急息悪悲";
		$a.="想意感所打投拾持指放";
		$a.="整旅族昔昭暑暗曲有服";
		$a.="期板柱根植業様横橋次";
		$a.="歯死氷決油波注泳洋流";
		$a.="消深温港湖湯漢炭物球";
		$a.="由申界畑病発登皮皿相";
		$a.="県真着短研礼神祭福秒";
		$a.="究章童笛第筆等箱級終";
		$a.="緑練羊美習者育苦荷落";
		$a.="葉薬血表詩調談豆負起";
		$a.="路身転軽農返追送速進";
		$a.="遊運部都配酒重鉄銀開";
		$a.="院陽階集面題飲館駅鼻";
	}
	else if ($set=="g4")
	{
		$a.="不争付令以仲伝位低例";
		$a.="便信倉候借停健側働億";
		$a.="兆児共兵典冷初別利刷";
		$a.="副功加努労勇包卒協単";
		$a.="博印参史司各告周唱喜";
		$a.="器囲固型堂塩士変央失";
		$a.="好季孫完官害察巣差希";
		$a.="席帯底府康建径徒得必";
		$a.="念愛成戦折挙改救敗散";
		$a.="料旗昨景最望未末札材";
		$a.="束松果栄案梅械極標機";
		$a.="欠歴残殺毒氏民求治法";
		$a.="泣浅浴清満漁灯無然焼";
		$a.="照熱牧特産的省祝票種";
		$a.="積競笑管節粉紀約結給";
		$a.="続置老胃脈腸臣航良芸";
		$a.="芽英菜街衣要覚観訓試";
		$a.="説課議象貨貯費賞軍輪";
		$a.="辞辺連達選郡量録鏡関";
		$a.="陸隊静順願類飛飯養験";
	}
	else if ($set=="g5")
	{
		$a.="久仏仮件任似余価保修";
		$a.="俵個備像再刊判制券則";
		$a.="効務勢厚句可営因団圧";
		$a.="在均基報境墓増夢妻婦";
		$a.="容寄富導居属布師常幹";
		$a.="序弁張往復徳志応快性";
		$a.="恩情態慣承技招授採接";
		$a.="提損支政故敵断旧易暴";
		$a.="条枝査格桜検構武比永";
		$a.="河液混減測準演潔災燃";
		$a.="版犯状独率現留略益眼";
		$a.="破確示祖禁移程税築精";
		$a.="素経統絶綿総編績織罪";
		$a.="群義耕職肥能興舌舎術";
		$a.="衛製複規解設許証評講";
		$a.="謝識護豊財貧責貸貿賀";
		$a.="資賛質輸述迷退逆造過";
		$a.="適酸鉱銅銭防限険際雑";
		$a.="非預領額飼";
	}
	else if ($set=="g6")
	{
		$a.="並乱乳亡仁供俳値傷優";
		$a.="党冊処刻割創劇勤危卵";
		$a.="厳収后否吸呼善困垂城";
		$a.="域奏奮姿存孝宅宇宗宙";
		$a.="宝宣密寸専射将尊就尺";
		$a.="届展層己巻幕干幼庁座";
		$a.="延律従忘忠憲我批担拝";
		$a.="拡捨探推揮操敬映晩暖";
		$a.="暮朗机枚染株棒模権樹";
		$a.="欲段沿泉洗派済源潮激";
		$a.="灰熟片班異疑痛皇盛盟";
		$a.="看砂磁私秘穀穴窓筋策";
		$a.="簡糖系紅納純絹縦縮署";
		$a.="翌聖肺背胸脳腹臓臨至";
		$a.="若著蒸蔵蚕衆裁装裏補";
		$a.="視覧討訪訳詞誌認誕誠";
		$a.="誤論諸警貴賃遺郵郷針";
		$a.="鋼閉閣降陛除障難革頂";
		$a.="骨";
	}
	else if ($set=="g7")
	{
		$a.="乙了又丈与及乞凡刃巾互丹乏井冗凶刈勾匂匹升厄双介孔";
		$a.="屯幻弔斗斤爪牙且丘丙丼巨仙凹凸占𠮟召囚奴尻尼巧払氾";
		$a.="汁込斥旦玄瓦甘甲矛伎仰伐伏充刑劣匠企吉叫吐吏壮如妃";
		$a.="妄尽巡帆弐忙扱汎汚汗江芋芝迅旨旬肌朽朱朴缶臼舟串亜";
		$a.="佐伺伸但伯伴克冶励却即呂含吟呉吹呈坑坊壱妖妥妊妨妙";
		$a.="寿尿尾岐床廷弄抗抄択把抜扶抑沙汰沃沖沢沈没狂芯芳迎";
		$a.="那邦阪忌忍戒戻攻更肘肝肖杉秀辛享依佳侍侮併免刹刺到";
		$a.="劾卓叔呪坪奈奇奉奔妬姓宛宜尚屈岡岳岬弥弦征彼怪怖拉";
		$a.="押拐拒拠拘拙拓抽抵拍披抱抹況沼泥泊泌沸泡狙苛茎苗茂";
		$a.="迭迫邪邸阻附房旺昆昇股肩肯肢肪枕枢析杯枠欧殴炎炊炉";
		$a.="采玩祈祉盲突虎阜斉亭侶侯俊侵促俗冠削勃勅卑卸厘叙咽";
		$a.="哀咲垣契威姻孤封峡峠帥帝幽弧悔恒恨拶拭括挟拷挑洪浄";
		$a.="津洞狭狩茨荒荘逃郊郎怨怠怒施昧是胎胆胞柿柵栃架枯柔";
		$a.="柄某柳為牲珍甚畏疫皆盆眉盾冒砕窃糾耐臭虐虹衷訃訂貞";
		$a.="赴軌香俺倹倒倣俸倫兼冥凄准凍剝剣剛剤剖匿唄哺唆唇哲";
		$a.="唐埋娯娠姫娘宴宰宵峰徐悦悟悩挨捉挫振捜挿捕浦浸浜浮";
		$a.="涙浪華逝逐逓途透陥陣恣恐恵恥恋恭扇拳敏脇脊脅脂朕胴";
		$a.="桁核桑栽桟栓桃殊殉烈珠祥泰畝畜畔疾症疲眠砲称租秩袖";
		$a.="被既粋索紛紡紋翁耗致般蚊衰託貢軒辱酎酌釜隻飢鬼竜曹";
		$a.="乾偽偶偵偏剰勘唾喝啓唯埼堆執培婚婆寂尉崖崎崇崩庶庸";
		$a.="彩彫惧惨惜悼捻捗掛掘掲控据措掃排描堀淫涯渇渓渋淑渉";
		$a.="淡添涼猫猛猟葛萎菓菊菌逸逮郭陰陳陶陪隆陵患悠戚斜斬";
		$a.="旋曽脚脱梗梨殻爽瓶痕盗眺窒符粗粘粒紺紹紳累羞粛舷舶";
		$a.="虚蛍蛇袋訟豚貪貫販赦軟酔釈釣頃鹿麻斎亀僅偉傍募傘喉";
		$a.="喩喚喫喪圏堪堅堕塚堤塔塀塁奥媛媒婿尋嵐項幅帽幾廃廊";
		$a.="弾御循慌惰愉握援換搭揚揺湧渦滋湿渡湾猶葬遇遂遅遍隅";
		$a.="随惑扉掌敢斑暁晶替普腕椅椎棺棋棚棟款欺殖煮焦琴畳疎";
		$a.="痩痘痢硬硝硫裕筒粧絞紫絡蛮裂詠詐詔診訴貼越超距軸酢";
		$a.="鈍閑雇雄雰須傲傾傑債催僧勧嗅嗣嘆塞塡毀塊塑塗奨嫉嫁";
		$a.="嫌寛寝廉彙微慄慨慎携搾摂搬溺滑溝滞滝漠滅溶猿蓋蓄遡";
		$a.="遜違遣隙隔愚慈愁暇腎腫腺腰楷棄楼歳殿煙煩煎献禍禅痴";
		$a.="睦睡督碁稚窟裾褐裸継羨艇虞虜蜂触詣詮該詰誇詳誉賂賊";
		$a.="賄跡践跳較載酬酪鉛鉢鈴雅雷零飾飽靴頓頑頒鼓僕僚塾墨";
		$a.="奪嫡寡寧彰徴憎慢摘漆漸漬滴漂漫漏蔑遮遭隠慕暦膜概熊";
		$a.="獄瑠瘍罰碑稲端箸箋箇綻維綱緒網腐蜜誓誘豪貌踊辣酵酷";
		$a.="銃銘閥雌需餅駆駄髪魂儀勲舗嘲嘱噴墜墳審寮履幣慶弊影";
		$a.="徹憧憬憤撮撤撲潰潟潤澄潜蔽遵遷慰憂慮戯摯撃摩敷暫膝";
		$a.="膚槽歓璃畿監盤罵罷稽稼稿穂窮窯範縁緩緊締縄衝褒誰謁";
		$a.="請諾賭賜賠賓賦趣踪踏輝輩舞鋭鋳閲震霊餓餌頰駒駐魅黙";
		$a.="儒凝壊墾壌壇壁嬢憶懐憾擁濁濃獲薫薪薦薄還避隣憩曇膳";
		$a.="膨獣磨穏篤緻緯縛繁縫融衡諦謎諧諮謀諭謡賢醒麺錦錮錯";
		$a.="錠錬隷頼骸償嚇擬擦濯懇戴曖臆燥爵犠環療瞳瞭矯礁繊翼";
		$a.="聴謹謙謄購轄醜鍵鍋鍛闇霜韓頻鮮齢濫藤藍藩懲璧癖癒瞬";
		$a.="礎穫襟糧繕繭翻覆贈鎌鎖鎮闘顎顕騎騒瀬藻爆璽羅簿繰艶";
		$a.="覇譜蹴離霧韻髄鯨鶏麓麗懸欄籍譲醸鐘響騰艦躍露顧魔鶴";
		$a.="籠襲驚鑑鬱";
	}
	else if ($set=="g8") // jinmeiyō
	{
		// 1) jinmeiyō kanji which are not traditional forms of jōyō or jinmeiyō kanji (632 chars)
		$a.="丑丞乃之乎也云亘些亦亥亨亮仔伊伍伽佃佑伶侃侑俄俠俣俐倭俱倦倖偲傭儲允兎兜其冴凌凜凧凪凰凱函劉劫勁勺勿匁";
		$a.="匡廿卜卯卿厨厩叉叡叢叶只吾吞吻哉哨啄哩喬喧喰喋嘩嘉嘗噌噂圃圭坐尭坦埴堰堺堵塙壕壬夷奄奎套娃姪姥娩嬉孟宏";
		$a.="宋宕宥寅寓寵尖尤屑峨峻崚嵯嵩嶺巌巫已巳巴巷巽帖幌幡庄庇庚庵廟廻弘弛彗彦彪彬徠忽怜恢恰恕悌惟惚悉惇惹惺惣";
		$a.="慧憐戊或戟托按挺挽掬捲捷捺捧掠揃摑摺撒撰撞播撫擢孜敦斐斡斧斯於旭昂昊昏昌昴晏晃晒晋晟晦晨智暉暢曙曝曳朋";
		$a.="朔杏杖杜李杭杵杷枇柑柴柘柊柏柾柚桧栞桔桂栖桐栗梧梓梢梛梯桶梶椛梁棲椋椀楯楚楕椿楠楓椰楢楊榎樺榊榛槙槍槌";
		$a.="樫槻樟樋橘樽橙檎檀櫂櫛櫓欣欽歎此殆毅毘毬汀汝汐汲沌沓沫洸洲洵洛浩浬淵淳渚淀淋渥湘湊湛溢滉溜漱漕漣澪濡瀕";
		$a.="灘灸灼烏焰焚煌煤煉熙燕燎燦燭燿爾牒牟牡牽犀狼猪獅玖珂珈珊珀玲琢琉瑛琥琶琵琳瑚瑞瑶瑳瓜瓢甥甫畠畢疋疏皐皓";
		$a.="眸瞥矩砦砥砧硯碓碗碩碧磐磯祇祢祐祷禄禎禽禾秦秤稀稔稟稜穣穹穿窄窪窺竣竪竺竿笈笹笙笠筈筑箕箔篇篠簞簾籾粥";
		$a.="粟糊紘紗紐絃紬絆絢綺綜綴緋綾綸縞徽繫繡纂纏羚翔翠耀而耶耽聡肇肋肴胤胡脩腔脹膏臥舜舵芥芹芭芙芦苑茄苔苺茅";
		$a.="茉茸茜莞荻莫莉菅菫菖萄菩萌萊菱葦葵萱葺萩董葡蓑蒔蒐蒼蒲蒙蓉蓮蔭蔣蔦蓬蔓蕎蕨蕉蕃蕪薙蕾蕗藁薩蘇蘭蝦蝶螺蟬";
		$a.="蟹蠟衿袈袴裡裟裳襖訊訣註詢詫誼諏諄諒謂諺讃豹貰賑赳跨蹄蹟輔輯輿轟辰辻迂迄辿迪迦這逞逗逢遥遁遼邑祁郁鄭酉";
		$a.="醇醐醍醬釉釘釧銑鋒鋸錘錐錆錫鍬鎧閃閏閤阿陀隈隼雀雁雛雫霞靖鞄鞍鞘鞠鞭頁頌頗顚颯饗馨馴馳駕駿驍魁魯鮎鯉鯛";
		$a.="鰯鱒鱗鳩鳶鳳鴨鴻鵜鵬鷗鷲鷺鷹麒麟麿黎黛鼎";
		// 2) jinmeiyō kanji that are traditional forms of jōyō kanji (212 chars)
		// 52 of them are html entities because they may not be safely copied
		$a.="亞惡爲&#64103;榮衞&#64098;圓緣薗"; //逸=64103 謁=64098
		$a.="應櫻奧橫溫價&#64082;&#64061;&#64069;壞";//禍=64082 悔=64061 海=64069
		$a.="懷樂渴卷陷寬&#64071;氣&#64078;&#64056;";//漢=64071 祈=64078
		$a.="僞戲虛峽狹&#64105;曉&#64052;&#64099;駈";
		$a.="勳薰惠揭鷄藝擊縣儉劍";
		$a.="險圈檢顯驗嚴廣恆黃國";
		$a.="黑&#64084;碎雜&#64077;&#64097;兒濕實&#64076;";
		$a.="&#64091;&#64072;壽收&#64092;從澁獸縱&#64081;";
		$a.="&#64067;&#64090;緖&#64034;敍將&#64026;涉燒奬";
		$a.="條狀乘淨剩疊孃讓釀&#64025;";
		$a.="眞寢愼盡粹醉穗瀨齊靜";
		$a.="攝&#64086;專戰纖禪&#64080;壯爭莊";
		$a.="搜巢曾裝&#64049;&#64059;瘦騷增&#64063;";
		$a.="藏&#64101;臟卽帶滯瀧單&#64055;團";
		$a.="彈晝鑄&#64095;廳徵聽&#64064;鎭轉";
		$a.="傳&#64038;嶋燈盜稻德&#64085;&#64104;拜";
		$a.="盃賣&#64068;髮拔&#64089;晚&#64053;祕&#64075;";
		$a.="&#64100;&#64065;冨&#64048;&#64027;拂佛&#64051;步峯";
		$a.="&#64058;飜每萬默埜彌藥與搖";
		$a.="樣謠來賴覽&#63773;龍&#63798;凉綠";
		$a.="淚壘&#63952;禮曆歷&#64087;鍊郞&#63785;&#63784;錄";//類=63952 練=64087 朗=63785 廊=63784
		// 3) jinmeiyō kanji that are traditional forms of other jinmeiyō kanji (18 chars)
		// 5 of them are html entities because they may not be safely copied
		$a.="亙凛堯巖晄檜槇&#64070;&#64022;&#64074;禰&#64079;禱祿&#64083;穰萠遙";//渚=64070 猪=64022 琢=64074 祐=64079 禎=64083
		// 4) jinmeiyō kanji added late (after 2015)
		$a.="渾";
		$a=html_entity_decode($a,ENT_NOQUOTES,'UTF-8');
	}
	else if ($set=="g9") // hyōgai
	{
		//  "１２３４５６７８９０１２３４５６７８９０１２３４５６７８９０１２３４５６７８９０"
		$a.="㐄㐭㐱㑒㔾㕚㕣㝴㝵㣊㣎㦮䖝丂丄丅丌业丨丩丬丱丶丿乁乂乇乍乚乜习亅亇亍于亏亚亠亢亲";
		$a.="亶亼亽什仇仌从佰佼侖侠倝倠倶僉僑僻儘儚儿兀兇兑关冂冉冋冖冝冫凋几凵刂刖别剃剥劃劦";
		$a.="勹匆匊匋匕匙匚匝匪匸區卄卆卉卦卩卬厂厃厉厭厶叕叚叛另叧叩叱吃吅吊吋吕吠吴呆呑呟咅";
		$a.="咠咢咳咸哥唖啇嘘噛噸噺嚢囁囗囬圣圥坤垚垢埠堇塘填塵壴壷夂夃夅夊夋夌夙夭夰夹夾妓妟";
		$a.="妾姐姑姦姶娄娼婁嬬嬰孛宀宁它宍尓尙尞尢尣尸尹屍屡屮岨岱崔嵒巛巜巠帀帚帛并幺广庖廓";
		$a.="廠廴廾开弋弗弼彊彐彑彔录彡彥彳怯怱悶惢愈慾憫戈戉戌戎戶扁扮捌掩掴掻揖摸撚撹擺擾攴";
		$a.="敖敞斌旁无旲昗昜曰曼朩朿杂杓杢枼柁栂栴桀桓梱棉椙椴楳樗樵橡橿檮歪歹殳毋氐气氶氺洩";
		$a.="涌涜淘渠溌漉漑潅澗澱澳濠濤瀞瀦烹焔煽熔燐燻爺爻爿牌牝牢狐狗狛狸狽猒猷珪甑甜甬甶畀";
		$a.="畐畕畦畫畷畺疒疹痔癌癶盈睪睿矧矮砺硲碇碍礦祘禀禦禸禺禿稗穆穎竃笍笥笨筏箆箪箭篭簸";
		$a.="粁粂粍粕粦糎糞糟糠綬緬繋繍网罒罠罫翏翟翫翰耆耒聯聾聿肀肰肱脆腿膵膿臤舍舘舛艮艸艹";
		$a.="芻苅苒苓苧苫荊荏莱菐菟菰葎葱蒋蒜蒦蔀蔚蕊蕩薮薯藷虍虻蚤蛋蛎蛙蛛蛤蛭蛸蛾蜘蝉蝋蝕蝿";
		$a.="蟻袁袷褌襾覗詑誹諌諜謬豈豕豖豦豸賈賎賏贋赫趨躯轆轍轡轤辟辨辵辶迺逼酋醗醤釆釦鈷鉤";
		$a.="鉦鉾銚鋤鋪鋲錨鍍鍔鍾鎗鎚鏑鐙鐸鑓镸閔隶隹雩靑靭韃韋韭韮頚頬顛飴餐駁騨髟髭鬥鬯鬲鮒";
		$a.="鮪鮫鮭鯖鯵鰍鰐鰭鰹鰻鱈鱚鴇鴎鴛鴦鴫鴬鵠鵡鸚鹵鹸麥麹黍黹黽鼠齒龜龝龠龹既𠀃𠁣𠂭𠃛𠃜";
		$a.="𠄌𠔾𠕁𠤎𠫓𠬶𠮠𠮷𡰪𡰯𢆉𢇇𦆕𦈢𦉫𦍎𦍒𦣻𧈡𧈧𫠠𫩏𫶧𮥶𰀪坴埶罙𨥫劵𠔉敄熏辯變辡䜌撥發𭚧";
		$a.="玻膊尃猜敝㡀廁拆倡襯做掉肚范抓闖聰醋貳瘋傅丐跟估刮癸裹滾哈孩喊毫盒很猴擠迹假餃驕";
		$a.="睛荅丵𦰌竟聚靠哭籃𦰩𠂎𠂑卪懶倆臉輛聊兩𠓜𠀉皀㫗賁匀屏涂孰胥冏聶聑爰襄宓禹戍兔澡弯";
		$a.="𠪚尗鄰蘿麩";
		$a.="々〇";
	}
	else if ($set=="gc")
	{
		$a.="⺀⺄⺆⺈⺊⺌⺕⺤⺥⺫⻌⻍⻎㐅㥑䒑丆丷乀乛产亻夗忄扌攵杀氵灬爫牜犭电礻糹耂衤覀阝飞";
		$a.="飠龰龴龵龶龷龸爫𠀎𠂆𠂇𠂉𠂊𠂋𠂌𠂒𠃊𠃋𠃌𠃍𠃑𠄎𠆢𠈌𠔿𠘨𠦝𠫔𠮛𡗗𡿨𢆶𢎥𢎨𤣩𤴓𤴔𥃭𥃲𥤧";
		$a.="𥫗𦍌𧘇𧰨𧾷𩙿𪜊𫝀𫢉𬀷𬺰𬺻𭕄𰀁𰃮𱼀⺳𠅃";
		// 罒 (net) != ⺫ (eye)
	}
	// zhHans
	else if (preg_match("/^hsk2[0-9]$/",$set)) $a.=getHskV2CharList($set);
	else if (preg_match("/^hsk3[0-9]$/",$set)) $a.=getHskV3CharList($set);
	else if ($set=="frequent2500")
	{
		// sorted by unicode done 
		$a.="一丁七万丈三上下不与丑专且世丘丙业丛东丝丢两严丧个中丰串临丸丹为主丽举乃久么义之乌乎乏乐乒乓乔乖乘乙九乞也习乡书买乱乳了予争事二于亏云互五井亚些亡交亦产亩享京亭亮亲人亿什仁仅仆仇今介仍从仓仔他仗付仙代令以仪们仰件价任份仿企伍伏伐休众优伙会伞伟传伤伪伯估伴伶伸似但位低住体何余佛作你佣佩佳使侄例侍供依侦侧侨侮侵便促俊俗俘保信俩俭修俯俱倍倒倘候倚借倡倦债值倾假偏做停健偶偷偿傅傍储催傲傻像僚僵僻儿允元兄充兆先光克免兔党入全八公六兰共关兴兵其具典养兼兽内冈册再冒写军农冠冤冬冰冲决况冶冷冻净准凉减凑凝几凡凤凭凯凳凶出击刀刃分切刊刑划列刘则刚创初删判利别刮到制刷券刺刻剂剃削前剑剖剥剧剩剪副割劈力劝办功加务劣动助努劫励劲劳势勇勉勒勤勺勾勿匀包匆化北匙匠匪匹区医十千升午半华协单卖南博卜占卡卧卫印危即却卵卷卸厂厅历厉压厌厕厘厚原厦厨去县参又叉及友双反发叔取受变叙叛叠口古句另叨只叫召叮可台史右叶号司叹叼吃各合吉吊同名后吐向吓吗君吞否吧吨吩含听启吴吵吸吹吼呀呆呈告员呜呢周味呼命和咏咐咬咱咳咸咽哀品哄哈响哑哗哥哨哪哭哲唇唉唐唤售唯唱啄商啊啦喂善喇喉喊喘喜喝喷嗓嗽嘉嘱嘴器嚷嚼囊四回因团园困围固国图圆圈土圣在地场圾址均坊坏坐坑块坚坛坝坟坡坦垂垃垄型垒垦垫垮埋城域培基堂堆堡堤堪堵塌塑塔塘塞填境墓墙增墨壁壤士壮声壳壶处备复夏夕外多夜够大天太夫央失头夸夹夺奇奉奋奏奔奖套奥女奴奶奸她好如妄妇妈妖妙妥妨妹妻始姐姑姓委姜姥姨姻姿威娃娇娘娱婆婚婶嫁嫂嫌嫩子孔孕字存孙孝孟季孤学孩宁它宅宇守安宋完宏宗官宙定宜宝实审客宣室宪宫宰害宴宵家容宽宾宿寄密寇富寒察寨寸对寺寻导寿封射将尊小少尖尘尚尝尤就尸尺尼尽尾尿局层居屈届屋屑展属屠屡屯山屿岁岂岔岗岛岩岭岸峡峰崇崖崭川州巡工左巧巨巩差己已巴巷巾币市布帅帆师希帐帖帘帜帝带席帮常帽幅幕干平年并幸幻幼广庄庆床序库应底店庙府废度座庭康庸廉廊延建开异弃弄弊式弓引弟张弦弯弱弹强归当录形彩影役彻彼往征径待很律徐徒得御循微德心必忆忌忍志忘忙忠忧快念忽怀态怎怒怕怖怜思怠急性怨怪总恋恐恒恢恨恩恭息恰恳恶恼悄悉悔悟悠患悦您悬悲悼情惊惑惕惜惠惧惨惩惭惯惰想惹愁愈愉意愚感愤愧愿慈慌慎慕慢慧慨慰懂懒戏成我戒或战戚截戴户房所扁扇手才扎扑扒打扔托扛扣执扩扫扬扭扮扯扰扶批找承技抄把抓投抖抗折抚抛抢护报披抬抱抵抹押抽担拆拉拌拍拐拒拔拖拘招拜拢拣拥拦拨择括拳拴拼拾拿持挂指按挎挑挖挠挡挣挤挥挨挪振挺挽捆捉捎捏捐捕捞损捡换捧据捷掀授掉掌掏排掘掠探接控推掩揉描提插握揪揭援搁搂搅搏搜搞搬搭携摄摆摇摊摔摘摧摩摸撇撑撒撕撞撤播操擦攀支收改攻放政故效敌敏救教敞敢散敬数敲整文斑斗料斜斤斥斧斩断斯新方施旁旅旋族旗无既日旦旧旨早旬旱时旷旺昂昆昌明昏易星映春昨是昼显晃晋晌晒晓晕晚晨普景晴晶智暂暑暖暗暮暴曲更曾替最月有朋服朗望朝期木未末本术朱朴朵机朽杀杂权杆李杏材村杜束杠条来杨杯杰松板极构析枕林果枝枣枪枯架柄柏某染柔柜查柱柳柴柿标栋栏树栗校株样核根格栽桂桃框案桌桐桑档桥桨桶梁梅梢梦梨梯械梳检棉棋棍棒棕棚森棵椅植椒楚楼概榆榜榨榴槐槽模横樱橘橡欠次欢欣欧欲欺款歇歉歌止正此步武歪死歼殃殊残殖段殿毁毅母每毒比毕毙毛毫毯氏民气氧水永汁求汇汉汗江池污汤汪汽沃沈沉沙沟没沫河沸油治沾沿泄泉泊法泛泡波泥注泪泰泳泻泼泽洁洋洒洗洞津洪洲活洽派流浅浆浇浊测济浑浓浙浩浪浮浴海浸涂消涉涌涛涝润涨液淋淘淡深混淹添清渐渔渗渠渡渣温港渴游湖湾湿溉源溜溪滋滑滔滚满滤滥滨滩滴漂漆漏演漠漫潜潮澡激灌火灭灯灰灵灶灾灿炉炊炎炒炕炭炮炸点炼烂烈烘烛烟烤烦烧烫热焦焰然煌煎煤照煮熄熊熔熟燃燕燥爆爪爬爱父爷爸爹爽片版牌牙牛牢牧物牲牵特牺犁犬犯状犹狂狐狗狠狡独狭狮狱狸狼猎猛猜猪猫献猴猾率玉王玩环现玻珍珠班球理琴瑞璃瓜瓣瓦瓶甘甚甜生用甩田由甲申电男画畅界畏留畜略番疆疏疑疗疤疫疮疯疲疼疾病症痒痕痛痰瘦登白百皂的皆皇皮皱盆盈益盏盐监盒盖盗盘盛盟目盯盲直相盼盾省眉看真眠眨眯眼着睁睛睡督睬瞎瞒瞧矛知矩短矮石矿码砌砍研砖破础硬确碌碍碎碑碗碧碰磁磨示礼社祖祝神祥票祸禁福离禽禾秀私秃秆秋种科秒秘租秤秧秩积称移稀程稍税稠稳稻稼稿穗穴究穷空穿突窃窄窑窗窜窝立竖站竞竟章童竭端竹竿笋笑笔笛符笨第笼等筋筐筑筒答策筛筝筹签简算管箩箭箱篇篮籍米类粉粒粗粘粥粪粮粱精糊糕糖糟糠系素索紧紫累絮繁纠红纤约级纪纯纱纲纳纵纷纸纹纺纽线练组细织终绍经绑绒结绕绘给络绝绞统绢绣继绩绪续绳维绵绸绿缎缓编缘缝缠缩缴缸缺罐网罗罚罢罩罪置羊美羞羡群羽翁翅翠翻翼耀老考者而耍耐耕耗耳耻耽聋职联聚聪肃肆肉肌肚肝肠股肢肤肥肩肯育肺肾肿胀胁胃胆背胖胜胞胡胳胶胸能脂脆脉脊脏脑脖脚脱脸脾腊腐腔腥腰腹腾腿膀膊膏膛膜膝膨臂臣自臭至致舅舌舍舒舞舟航般舰舱船艇艘良艰色艳艺节芒芝芦芬花芳芹芽苍苏苗若苦英苹茂范茄茅茎茧茫茶草荐荒荡荣药荷莫莲获菊菌菜菠萄萌萍萝营落著葛葡董葬葱葵蒙蒜蒸蓄蓝蓬蔑蔬蔽蕉薄薪薯藏虎虏虑虚虫虹虽虾蚀蚁蚂蚊蚕蛇蛋蛙蛛蛮蛾蜂蜓蜘蜜蜡蜻蝇蝴蝶融螺蠢血行衔街衡衣补表衫衬衰袄袋袍袖袜被袭裁裂装裕裙裤裳裹西要覆见观规视览觉角解触言誉誓警计订认讨让训议讯记讲许论讽设访证评识诉诊词译试诗诚话诞询该详语误诱说诵请诸读课谁调谅谈谊谋谎谜谢谣谦谨谱谷豆象豪貌贝贞负贡财责贤败货质贩贪贫购贯贱贴贵贷贸费贺贼贿资赌赏赔赖赚赛赞赠赢赤走赴赵赶起趁超越趋趟趣足趴跃跌跑距跟跨跪路跳践踏踢踩踪蹄蹈蹦蹲躁身躬躲躺车轧轨转轮软轰轻载轿较辅辆辈辉输辛辜辞辟辣辨辩辫辰辱边辽达迁迅过迈迎运近返还这进远违连迟迫述迷迹追退送适逃逆选透逐递途逗通逝速造逢逮逼遇遍道遗遣遥遭遮遵避邀那邪邮邻郊郎郑部都鄙配酒酬酱酷酸酿醉醋醒采释里重野量金鉴针钉钓钞钟钢钥钩钱钳钻铁铃铅铜铲银铸铺链销锁锄锅锈锋锐错锡锣锤锦键锯锹锻镇镜镰长门闪闭问闯闲间闷闸闹闻阀阁阅阔队防阳阴阵阶阻阿附际陆陈降限陕陡院除险陪陵陶陷隆随隐隔隙障隶难雀雁雄雅集雕雨雪零雷雹雾需震霉霜霞露霸青静非靠面革鞋鞠鞭音韵页顶顷项顺须顽顾顿颂预领颈颗题颜额颠颤风飘飞食餐饥饭饮饰饱饲饶饺饼饿馅馆馋馒首香马驰驱驳驴驶驻驼驾骂骄骆验骑骗骡骤骨高鬼魂魄魔鱼鲁鲜鸟鸡鸣鸦鸭鸽鹅鹊鹰鹿麦麻黄黎黑默鼓鼠鼻齐齿龄龙龟";
	}
	else if ($set=="lessFrequent1000")
	{
		// sorted by unicode done 
		$a.="丐乍乾亥仑仲伊伦伺佃佑侈侠侣侥侯俄俏俐俺倔偎傀僧儒儡兑兜兢冀冕冗冯凄凌凛凫凰凸凹函凿刁刨刹刽剔剿勃勋勘募匈匕匣匾匿卑卒卓卢卤卦卿厢叁叭叽吁吆吏吕吝吟吠吭吮吱吻呐呕呛呵呻咆咒咕咖咙咧咨咪哆哎哟哩哮哺哼唁唆唠唧唬唾啃啡啤啥啰啸啼喧喳喻嗅嗜嗡嗤嗦嘀嘁嘲嘶嘹嘿噩噪嚎嚣囚囤囱圃坎坞坠坤坪坯坷垛垢埂埃埠堕堰墅墩壕壹夭夯夷奄奈契奕奠奢妆妒妓姆姊姚娄娜娩娶婉婴婿媒媚媳嫉嫡嬉孵孽宛宠宦寂寓寝寞寡寥尉尔屁屉屎屏履屹岖岳峦峭峻崎崔崩嵌巍巢巫帕帚幌幔幢幽庇庐庞庵庶廓廷弛弥弧彤彪彬彭彰徊徘徙徽忱忿怔怯恃恍恕恤恬悍悯悴惋惦惫惶愕慷憋憎憔憨憾懈懊懦戈戳扳扼抑抒抠抡拂拄拇拓拗拙拟拧拭拯拱拷挚挟挫捂捅捌捍捣捶捺捻掂掐掖措掰掷掸掺揍揖揣揩揽搀搓搔搪摹撩撬撮撰撵撼擂擅擎擒攒攘敛敦敷斋斟旭昔昙昧昭昵晤晦晰晾暇曙曹曼朦杈杉杖杭枉枚枢枫枷柑柒柠柬栅栈栓栖桅桦桩梆梗梧梭棘棠棱棺椎椭椰椿楔楞楣楷榄榔榕榛樊樟橄橙橱檀檐檩檬歧歹殉殴殷毡氓氛氢氨氮氯汛汞汰汹沐沛沥沦沧沪沮沼沽泌泞泣泵洛洼浦涎涕涡涣涤涧涩涮涯涵淀淆淌淑淤淫淮淳渊渤渺湃湘溃溅溢溯溶溺滓滞漓漩漱漾潘潦潭澄澈澎澜澳濒瀑灸灼炫炬烁烙烹焊焕焙焚煞熏熙熬燎爵牍牡犀狈狞狰猖猩猬猿玄玖玛玫玲玷珊琅琉琐琢琳琼瑟瑰璧瓢瓤瓮瓷甥甫甸畔畦畴畸疙疚疟疹痊痘痢痪痴痹瘟瘤瘩瘪瘫瘸瘾癌癞癣皿盅盔盹眶眷睦睹瞄瞪瞬瞭瞳瞻矗矢矫矾砂砚砰砸砾硅硕硝硫硼碉碘碟碱碳碴碾磅磕磷礁祈祟祠祭祷禀秉秕秦秫秸秽稚稽穆窍窒窖窘窟窥窿竣笆笙笤筏筷箍箕箫篓篙篡篱篷簇簸簿籽粟粤粹糙糜糯紊纫纬绅绊绎绰绷综绽缀缅缆缔缕缚缤缨缭缰罕署羔羹翎翔翘翩翰耘耙耸耿聂聊聘肄肋肖肘肛肪肮肴胎胚胧胯胰脐脓脯腋腌腕腮腺腻膘膳臀臊臼舀舆舔舵舶舷艾芋芍芙芜芥芭芯苇苔苛苞苟苫茁茉茬茴茵茸荆荔荚荞荠荤荧荸莉莱莹莺莽菇菩菱菲萎萤萧萨葫蒂蒋蒲蒿蓉蓖蔓蔗蔚蔫蔼蕊蕴蕾薇薛藐藕藤藻蘑蘸虐虱蚌蚓蚜蚣蚤蚪蚯蛀蛆蛉蛔蛤蛹蜀蜈蜒蜕蜗蝉蝌蝎蝗蝙蝠螃螟蟀蟆蟋蟥蟹蠕衅衍衙衩衷袁袒袱裆裸褂褐褒褥褪襟觅誊譬讥讳讶讹讼诀诅诈诡诫诬诲诺诽谆谍谐谒谓谚谤谬谭谴豁豌豫豹豺账贬贮贰贾赁赂赃赊赋赎赐赘赡赦赫趾跋跛跷跺踊踱蹂蹋蹬蹭躏躯轩轴辐辑辕辖辙迂迄逊逛逞逸逻逾遂遏邑邓邢邦郁郭酌酗酝酣酥酪酵醇钙钝钠钦钧钮钾铆铐铛铝铡铣铭锉锌锚锥锨锭锰镀镊镐镣镶闰闺闽阎阐阱陋陌陨隅隘隧雇雌雏雳霍霎霹靖靡靴靶鞍韧韩韭颁颅颇颊频颓颖飒饵馁馍馏驮驯驹骇骏骚髓鬓魁魏鲤鲫鲸鳄鳍鳖鳞鸠鸥鸯鸳鸵鸿鹃鹉鹏鹤鹦麸黍黔鼎";
	}
	else if ($set=="frequent3500")
	{
		$a.=getCharList("frequent2500").getCharList("lessFrequent1000");
	}
	else if ($set=="common7000")
	{
		// sorted by unicode done 
		$a.="一丁七万丈三上下不与丐丑专且丕世丘丙业丛东丝丞丢两严丧个丫中丰串临丸丹为主丽举乂乃久么义之乌乍乎乏乐乒乓乔乖乘乙乜九乞也习乡书乩买乱乳乾了予争事二亍于亏云互亓五井亘亚些亟亡亢交亥亦产亨亩享京亭亮亲亳亵亶亸人亿什仁仂仃仄仅仆仇仉今介仍从仑仓仔仕他仗付仙仞仟仡代令以仨仪仫们仰仲仳仵件价任份仿企伉伊伋伍伎伏伐休众优伙会伛伞伟传伢伤伥伦伧伪伫伯估伴伶伸伺似伽伾佃但位低住佐佑体何佗佘余佚佛作佝佞佟你佣佤佥佩佬佯佰佳佴佶佻佼佾使侃侄侈侉例侍侏侑侔侗供依侠侣侥侦侧侨侩侪侬侮侯侵便促俄俅俊俎俏俐俑俗俘俚俜保俞俟信俣俦俨俩俪俭修俯俱俳俵俶俸俺俾倌倍倏倒倓倔倘候倚倜倞借倡倥倦倨倩倪倬倭债倻值倾偃假偈偌偎偏偕做停健偬偲偶偷偻偾偿傀傅傈傍傣傥傧储傩催傲傻僇像僖僚僦僧僬僭僮僰僳僵僻儆儇儋儒儡儿兀允元兄充兆先光克免兑兔兕兖党兜兢入全八公六兮兰共关兴兵其具典兹养兼兽冀冁内冈冉册再冒冕冗写军农冠冢冤冥冬冯冰冱冲决况冶冷冻冼冽净凄准凇凉凋凌减凑凛凝几凡凤凫凭凯凰凳凶凸凹出击凼函凿刀刁刃分切刈刊刍刎刑划刖列刘则刚创初删判刨利别刭刮到刳制刷券刹刺刻刽刿剀剁剂剃剅削剌前剐剑剔剕剖剜剞剟剡剥剧剩剪副割剽剿劁劂劈劐劓力劝办功加务劢劣动助努劫劬劭励劲劳劾势勃勇勉勋勍勐勒勖勘募勤勩勰勺勾勿匀包匆匈匍匏匐匕化北匙匜匝匠匡匣匦匪匮匹区医匾匿十千卅升午卉半华协卑卒卓单卖南博卜卞卟占卡卢卣卤卦卧卫卮卯印危即却卵卷卸卺卻卿厂厄厅历厉压厌厍厕厘厚厝原厢厣厥厦厨厩厮去厾县叁参又叉及友双反发叔取受变叙叛叟叠口古句另叨叩只叫召叭叮可台叱史右叵叶号司叹叻叼叽吁吃各吆合吉吊同名后吏吐向吓吕吗君吝吞吟吠吡吣否吧吨吩含听吭吮启吱吲吴吵吸吹吻吼吾呀呃呆呈告呋呐呓呔呕呖呗员呙呛呜呢呤呦周呱呲味呵呶呷呸呻呼命咀咂咄咆咋和咎咏咐咒咔咕咖咙咚咛咝咣咤咦咧咨咩咪咫咬咭咯咱咳咴咸咻咽咿哀品哂哄哆哇哈哉哌响哎哏哐哑哓哔哕哗哙哚哝哞哟哥哦哧哨哩哪哭哮哲哳哺哼哽哿唁唆唇唉唏唐唑唔唛唝唠唢唣唤唧唪唬售唯唱唳唷唼唾唿啁啃啄商啉啊啐啕啖啜啡啤啥啦啧啪啬啭啮啰啴啵啶啷啸啻啼啾喀喁喂喃善喇喈喉喊喋喏喑喔喘喙喜喝喟喤喧喱喳喵喷喹喻喽喾嗄嗅嗉嗌嗍嗑嗒嗓嗔嗖嗜嗝嗞嗟嗡嗣嗤嗥嗦嗨嗪嗫嗬嗯嗲嗳嗵嗷嗽嗾嘀嘁嘈嘉嘌嘎嘏嘘嘚嘛嘞嘟嘡嘣嘤嘧嘬嘭嘱嘲嘴嘶嘹嘻嘿噀噌噍噎噔噗噙噜噢噤器噩噪噫噬噱噶噻噼嚄嚅嚆嚎嚏嚓嚚嚣嚯嚷嚼囊囔囚四囝回囟因囡团囤囫园困囱围囵囹固国图囿圃圄圆圈圉圊圜土圣在圩圪圬圭圮圯地圳圹场圻圾址坂均坊坌坍坎坏坐坑块坚坛坜坝坞坟坠坡坤坦坨坩坪坫坭坯坳坷坻坼垂垃垄垅垆型垌垍垒垓垛垞垟垠垡垢垣垤垦垧垩垫垭垮垯垱垲垸埂埃埋城埏埒埔埕埘埙埚埝域埠埭埯埴埸培基埼埽堂堆堇堉堋堌堍堑堕堙堞堠堡堤堪堰堵塃塄塆塈塌塍塑塔塘塞塥填塬塮塾墀墁境墅墈墉墒墓墙增墟墦墨墩墼壁壅壑壕壤士壬壮声壳壶壹处备复夏夔夕外夙多夜够夤夥大天太夫夬夭央夯失头夷夸夹夺夼奁奂奄奇奈奉奋奎奏契奔奕奖套奘奚奠奢奥奭女奴奶奸她好妁如妃妄妆妇妈妊妍妒妓妖妗妙妞妣妤妥妨妩妪妫妮妯妲妹妻妾姆姊始姐姑姒姓委姗姘姚姜姝姞姣姥姨姬姹姻姽姿威娃娄娅娆娇娈娉娌娑娓娘娜娟娠娣娥娩娱娲娴娶娼婀婆婉婊婕婚婞婢婧婪婳婴婵婶婷婺婿媒媚媛媪媲媳媵媸媾嫁嫂嫉嫌嫒嫔嫖嫘嫚嫜嫠嫡嫣嫦嫩嫪嫫嫱嬉嬖嬗嬴嬷孀子孑孓孔孕字存孙孚孛孜孝孟孢季孤孥学孩孪孬孰孱孳孵孺孽宁它宄宅宇守安宋完宏宓宕宗官宙定宛宜宝实宠审客宣室宥宦宪宫宬宰害宴宵家宸容宽宾宿寂寄寅密寇富寐寒寓寝寞察寡寤寥寨寮寰寸对寺寻导寿封射将尉尊小少尔尕尖尘尚尜尝尤尥尧尬就尴尸尹尺尻尼尽尾尿局屁层屃居屈屉届屋屎屏屐屑展屙属屠屡屣履屦屯山屹屺屿岁岂岈岌岍岐岑岔岖岗岘岙岚岛岢岣岩岫岬岭岱岳岵岷岸岿峁峂峄峋峒峙峡峣峤峥峦峧峨峪峭峰峻崂崃崆崇崎崔崖崛崞崟崤崦崩崭崮崴崽嵇嵊嵋嵌嵎嵖嵘嵚嵛嵝嵩嵫嵬嵯嵴嶂嶓嶙嶝嶷巅巉巍川州巡巢工左巧巨巩巫差巯己已巳巴巷巽巾币市布帅帆师希帏帐帑帔帕帖帘帙帚帛帜帝帡带帧席帮帱帷常帻帼帽幂幄幅幌幔幕幛幞幡幢幪干平年并幸幺幻幼幽广庀庄庆庇床庋序庐庑库应底庖店庙庚府庞废庠庤庥度座庭庳庵庶康庸庹庼庾廉廊廋廒廓廖廙廛廨廪延廷建廿开弁异弃弄弇弈弊弋式弑弓引弗弘弛弟张弥弦弧弩弭弯弱弹强弼彀归当录彖彗彘彝形彤彦彧彩彪彬彭彰影彳彷役彻彼往征徂径待徇很徉徊律徐徒徕得徘徙徜御徨循徭微徵德徼徽心必忆忉忌忍忏忐忑忒忖志忘忙忝忠忡忤忧忪快忭忮忱念忸忻忽忾忿怀态怂怃怄怅怆怊怍怎怏怒怔怕怖怙怛怜思怠怡急怦性怨怩怪怫怯怵总怼怿恁恂恃恋恍恐恒恕恙恚恝恢恣恤恧恨恩恪恫恬恭息恰恳恶恸恹恺恻恼恽恿悃悄悉悌悍悒悔悖悚悛悝悟悠悢患悦您悫悬悭悯悱悲悴悸悻悼情惆惇惊惋惑惕惘惚惜惝惟惠惦惧惨惩惫惬惭惮惯惰想惴惶惹惺愀愁愆愈愉愎意愔愕愚感愠愣愤愦愧愫愿慈慊慌慎慑慕慝慢慥慧慨慭慰慵慷憋憎憔憝憧憨憩憬憷憾懂懈懊懋懑懒懦懵懿戆戈戊戋戌戍戎戏成我戒戕或戗战戚戛戟戡戢戥截戬戮戳戴户戽戾房所扁扃扅扇扈扉扊手才扎扑扒打扔托扛扣扦执扩扪扫扬扭扮扯扰扳扶批扺扼找承技抃抄抉把抑抒抓抔投抖抗折抚抛抟抠抡抢护报抨披抬抱抵抹抻押抽抿拂拃拄担拆拇拈拉拊拌拍拎拐拒拓拔拖拗拘拙拚招拜拟拢拣拤拥拦拧拨择括拭拮拯拱拳拴拶拷拼拽拾拿持挂指挈按挎挑挖挚挛挝挞挟挠挡挢挣挤挥挦挨挪挫振挲挹挺挽捂捃捅捆捉捋捌捍捎捏捐捕捞损捡换捣捧捩捭据捯捶捷捺捻掀掂掇授掉掊掌掎掏掐排掖掘掠探掣接控推掩措掬掭掮掰掳掴掷掸掺掼掾揄揆揉揍揎描提插揖揞揠握揣揩揪揭揳援揶揸揽揾揿搀搁搂搅搋搌搏搐搒搓搔搛搜搞搠搡搦搪搬搭搴携搽摁摄摅摆摇摈摊摒摔摘摞摧摩摭摸摹摺摽撂撄撅撇撑撒撕撖撙撞撤撩撬播撮撰撵撷撸撺撼擀擂擅操擎擐擒擘擞擢擤擦攀攉攒攘攥攫攮支收攸改攻放政故效敉敌敏救敕敖教敛敝敞敢散敦敫敬数敲整敷文斋斌斐斑斓斗料斛斜斝斟斡斤斥斧斩斫断斯新方於施旁旃旄旅旆旋旌旎族旒旖旗无既日旦旧旨早旬旭旮旯旰旱时旷旸旺旻昀昂昃昆昉昊昌明昏易昔昕昙昝星映春昧昨昭是昱昴昵昶昼昽显晁晃晋晌晏晒晓晔晕晖晗晚晞晟晡晢晤晦晨普景晰晴晶晷智晾暂暄暅暇暌暑暖暗暝暧暨暮暴暹暾曈曙曛曜曝曦曩曰曲曳更曷曹曼曾替最月有朊朋服朐朔朕朗望朝期朦木未末本札术朱朴朵机朽杀杂权杆杈杉杌李杏材村杓杖杜杞束杠条来杧杨杪杭杯杰杲杳杵杷杻杼松板极构枇枉枋析枕林枘枚果枝枞枢枣枥枧枨枪枫枭枯枰枳枵架枷枸柁柃柄柈柏某柑柒染柔柘柙柚柜柝柞柠柢查柩柬柯柰柱柳柴柽柿栀栅标栈栉栊栋栌栎栏树栒栓栖栗栝栟校栩株栲栳样核根格栽栾桀桁桂桃桄桅框案桉桊桌桎桐桑桓桔桕桡桢档桤桥桦桧桨桩桫桴桶桷梁梃梅梆梏梓梗梢梦梧梨梭梯械梳梵梽梾检棁棂棉棋棍棒棕棘棚棠棣棨棬森棰棱棵棹棺棻棼椁椅椋植椎椐椑椒椟椠椤椭椰椴椽椿楂楔楗楚楝楞楠楣楦楫楮楯楷楸楹楼榀概榄榆榇榈榉榍榔榕榖榛榜榧榨榫榭榴榷榻槁槊槌槎槐槔槚槛槜槟槠槭槲槽槿樊樗樘樟模樨横樯樱樵樽樾橄橇橐橘橙橛橡橥橦橱橹橼檀檄檎檐檑檗檠檩檫檬檵欠次欢欣欤欧欲欸欺款歃歆歇歉歌歙止正此步武歧歪歹死歼殁殂殃殄殆殇殉殊残殍殒殓殖殚殛殡殣殪殳殴段殷殿毁毂毅毋母每毐毒毓比毕毖毗毙毛毡毪毫毯毳毵毹毽氅氆氇氍氏氐民氓气氕氖氘氙氚氛氟氡氢氤氦氧氨氩氪氮氯氰氲水永氽汀汁求汆汇汈汉汊汐汔汕汗汛汜汝汞江池污汤汨汩汪汭汰汲汴汶汹汽汾沁沂沃沄沅沆沈沉沌沏沐沓沔沘沙沚沛沟没沣沤沥沦沧沨沩沪沫沭沮沱河沸油治沼沽沾沿泃泄泅泉泊泌泐泓泔法泖泗泚泛泜泞泠泡波泣泥注泪泫泮泯泰泱泳泵泷泸泺泻泼泽泾洁洄洇洋洌洎洑洒洗洙洚洛洞洣津洧洨洪洫洮洱洲洳洴洵洹洺活洼洽派流浃浅浆浇浈浉浊测浍济浏浐浑浒浓浔浕浙浚浜浞浠浡浣浥浦浩浪浮浯浴海浸浼涂涅消涉涌涎涑涓涔涕涘涛涝涞涟涠涡涢涣涤润涧涨涩涪涫涮涯液涵涸涿淀淄淅淆淇淋淌淏淑淖淘淙淝淞淠淡淤淦淫淬淮深淳混淹添清渊渌渍渎渐渑渔渗渚渝渠渡渣渤渥温渫渭港渲渴游渺湃湄湉湍湎湔湖湘湛湜湝湟湨湫湮湲湾湿溃溅溆溇溉溏源溘溜溟溠溢溥溦溧溪溯溱溲溴溶溷溺溻溽滁滂滃滇滋滍滏滑滓滔滕滗滘滚滞滟滠满滢滤滥滦滨滩滪滫滴滹漂漆漉漏漓演漕漠漤漩漪漫漭漯漱漳漶漾潆潇潋潍潏潘潜潞潟潢潦潭潮潲潴潵潸潺潼潽澄澈澉澌澍澎澜澡澥澧澳澴澶澹澼激濂濉濑濒濞濠濡濮濯瀌瀍瀑瀚瀛瀣瀵瀹灌灏灞火灭灯灰灵灶灸灼灾灿炀炅炉炊炎炒炔炕炖炙炜炝炟炫炬炭炮炯炱炳炷炸点炻炼炽烀烁烂烃烈烊烘烙烛烜烝烟烤烦烧烨烩烫烬热烯烷烹烺烽焉焊焌焐焓焕焖焘焙焚焜焦焯焰焱然煅煊煌煎煜煞煤煦照煨煮煲煳煸煺煽熄熊熏熔熘熙熜熟熠熥熨熬熵熹燃燊燎燏燔燕燠燥燧燮燹爆爝爨爪爬爰爱爵父爷爸爹爻爽爿牁牂片版牌牍牒牖牙牚牛牝牟牡牢牦牧物牮牯牲牵特牺牾犀犁犄犊犋犍犏犒犟犨犬犯犰犴状犷犸犹狁狂狃狄狈狉狍狎狐狒狗狙狝狞狠狡狨狩独狭狮狯狰狱狲狳狴狷狸狺狻狼猁猃猄猊猎猕猖猗猛猜猝猞猡猢猥猩猪猫猬献猱猴猷猸猹猾猿獍獐獒獗獠獬獭獯獴獾玄率玉王玎玑玕玖玙玚玛玠玡玢玥玦玩玫玮环现玲玳玷玺玻珀珂珈珉珊珍珏珐珑珙珞珠珣珥珧珩班珰珲珽球琅理琇琉琎琏琐琚琛琢琤琥琦琨琪琫琬琮琯琰琳琴琵琶琼瑀瑁瑄瑕瑗瑙瑚瑛瑜瑞瑟瑢瑭瑰瑶瑾璀璁璃璆璇璈璋璎璐璘璜璞璟璠璧璨璩璪瓒瓘瓜瓞瓠瓢瓣瓤瓦瓮瓯瓴瓶瓷瓻瓿甄甍甏甑甓甘甙甚甜生甥用甩甪甫甬甭田由甲申电男甸町画甾畀畅畈畋界畎畏畔留畚畛畜略畦番畯畲畴畸畹畿疃疆疍疏疑疔疖疗疙疚疝疟疠疡疢疣疤疥疫疬疭疮疯疰疱疲疳疴疵疸疹疼疽疾痂痃痄病症痈痉痊痍痒痔痕痘痛痞痢痣痤痦痧痨痪痫痰痱痴痹痼痿瘁瘃瘅瘆瘊瘌瘐瘗瘘瘙瘛瘟瘠瘢瘤瘥瘦瘩瘪瘫瘭瘰瘳瘴瘵瘸瘼瘾瘿癀癃癌癍癔癖癜癞癣癫癯癸登白百皂的皆皇皈皋皎皑皓皖皤皮皱皲皴皿盂盅盆盈盉益盍盎盏盐监盒盔盖盗盘盛盟盥盦目盯盱盲直相盹盼盾省眄眇眈眉眊看眍眙眚真眠眢眦眨眩眬眭眯眵眶眷眸眺眼着睁睃睇睐睑睚睛睡睢督睥睦睨睫睬睹睽睾睿瞀瞄瞅瞌瞍瞎瞑瞒瞟瞠瞢瞥瞧瞩瞪瞬瞭瞰瞳瞵瞻瞽瞿矍矗矛矜矢矣知矧矩矫矬短矮石矶矸矻矽矾矿砀码砂砉砌砍砑砒研砖砗砘砚砜砝砟砣砥砧砭砮砰破砷砸砹砺砻砼砾础硁硅硇硌硎硐硒硕硖硗硚硝硪硫硬硭确硷硼碇碉碌碍碎碑碓碗碘碚碛碜碟碡碣碥碧碰碱碲碳碴碶碹碾磁磅磉磊磋磐磔磕磙磨磬磲磴磷磺礁礅礌礓礞礤礳礴示礼社祀祁祃祆祈祉祎祓祖祗祚祛祜祝神祟祠祢祥祧票祭祯祲祷祸祺祼祾禀禁禄禅禊福禚禤禧禳禹禺离禽禾秀私秃秆秉秋种科秒秕秘租秣秤秦秧秩秫秭积称秸移秽秾稀稂稃稆程稍税稔稗稚稞稠稣稳稷稻稼稽稿穄穆穑穗穰穴究穷穸穹空穿窀突窃窄窅窈窍窑窒窕窖窗窘窜窝窟窠窣窥窦窨窬窭窳窸窿立竑竖站竞竟章竣童竦竭端竹竺竽竿笃笄笆笈笊笋笏笑笔笕笙笛笞笠笤笥符笨笪笫第笮笱笳笸笺笼笾筅筇等筋筌筏筐筑筒答策筘筚筛筜筝筠筢筮筱筲筵筷筹筻筼签简箅箍箐箓箔箕算箜管箢箦箧箨箩箪箫箬箭箱箴箸篁篆篇篌篑篓篙篚篝篡篥篦篪篮篱篷篼篾簃簇簉簋簌簏簖簟簠簦簧簪簸簿籀籁籍米籴类籼籽粉粑粒粕粗粘粜粝粞粟粤粥粪粮粱粲粳粹粼粽精糁糅糇糈糊糌糍糕糖糗糙糜糟糠糨糯糵系紊素索紧紫累絮絷綦綮縻繁繄繇纂纛纠纡红纣纤纥约级纨纩纪纫纬纭纯纰纱纲纳纴纵纶纷纸纹纺纻纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绑绒结绔绕绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫续绮绯绰绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缌缎缏缑缒缓缔缕编缗缘缙缚缛缜缝缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵缶缸缺罂罄罅罐网罔罕罗罘罚罟罡罢罨罩罪置罱署罴罹罽罾羁羊羌美羑羔羚羝羞羟羡群羧羯羰羲羸羹羼羽羿翁翅翊翌翎翔翕翘翙翚翟翠翡翥翦翩翮翯翰翱翳翻翼耀老考耄者耆耋而耍耐耒耔耕耖耗耘耙耜耠耢耥耦耧耨耩耪耰耱耲耳耵耶耷耸耻耽耿聂聃聆聊聋职聍聒联聘聚聩聪聱聿肃肄肆肇肉肋肌肓肖肘肚肛肝肟肠股肢肤肥肩肪肫肭肮肯肱育肴肷肺肼肽肾肿胀胁胂胃胄胆背胍胎胖胗胙胚胛胜胝胞胡胤胥胧胨胩胪胫胬胭胯胰胱胲胳胴胶胸胺胼能脂脆脉脊脍脎脏脐脑脒脓脔脖脘脚脞脧脬脯脱脲脶脸脾腆腈腊腋腌腐腑腒腓腔腕腙腚腠腥腧腩腭腮腰腱腴腹腺腻腼腽腾腿膀膂膈膊膏膑膘膙膛膜膝膦膨膪膳膺膻臀臁臂臃臆臊臌臑臜臣臧自臬臭至致臻臼臾舀舂舄舅舆舌舍舐舒舔舛舜舞舟舢舣舨航舫般舰舱舳舴舵舶舷舸船舻舾艄艇艋艘艚艟艨艮良艰色艳艴艺艽艾艿节芄芈芊芋芍芎芏芑芒芗芙芜芝芟芡芥芦芨芩芪芫芬芭芮芯芰花芳芴芷芸芹芼芽芾苁苄苇苈苊苋苌苍苎苏苑苒苓苔苕苗苘苛苜苞苟苠苡苣苤若苦苫苯英苴苷苹苻茀茁茂范茄茅茆茈茉茌茎茏茑茓茔茕茗茚茛茜茝茧茨茫茬茭茯茱茳茴茵茶茸茹茼荀荃荆荇草荏荐荑荒荔荙荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭药荷荸荻荼荽莅莆莉莎莒莓莘莙莛莜莞莠莨莩莪莫莰莱莲莳莴莶获莸莹莺莼莽菀菁菂菅菇菊菌菏菔菖菘菜菝菟菠菡菥菩菪菰菱菲菹菼菽萁萃萄萋萌萍萎萏萑萘萜萝萤营萦萧萨萩萱萸萼落葆葑葓葖著葚葛葜葡董葩葫葬葭葱葳葵葶葸葺蒂蒇蒈蒉蒋蒌蒎蒗蒙蒜蒟蒡蒯蒲蒴蒸蒹蒺蒽蒿蓁蓂蓄蓇蓉蓊蓍蓐蓑蓓蓖蓝蓟蓠蓣蓥蓦蓬蓰蓼蓿蔌蔑蔓蔗蔚蔟蔡蔫蔬蔷蔸蔹蔺蔻蔼蔽蕃蕈蕉蕊蕖蕙蕞蕤蕨蕰蕲蕴蕹蕺蕻蕾薄薅薇薏薛薜薤薨薪薮薯薰薷薹藁藉藏藐藓藕藜藠藤藩藻藿蘅蘑蘖蘘蘧蘩蘸蘼虎虏虐虑虔虚虞虢虫虬虮虱虹虺虻虼虽虾虿蚀蚁蚂蚊蚋蚌蚍蚓蚕蚜蚝蚣蚤蚧蚨蚩蚪蚬蚯蚰蚱蚴蚶蚺蛀蛄蛆蛇蛉蛊蛋蛎蛏蛐蛑蛔蛘蛙蛛蛞蛟蛤蛩蛭蛮蛰蛱蛲蛳蛴蛸蛹蛾蜀蜂蜃蜇蜈蜉蜊蜍蜎蜒蜓蜕蜗蜘蜚蜜蜞蜡蜢蜣蜥蜩蜮蜱蜴蜷蜻蜾蜿蝇蝈蝉蝌蝎蝓蝗蝙蝠蝣蝤蝥蝮蝰蝴蝶蝻蝼蝽蝾螂螃螅螈螋融螗螟螠螣螨螫螬螭螯螳螵螺螽蟀蟆蟊蟋蟑蟒蟛蟠蟥蟪蟮蟹蟾蠃蠊蠋蠓蠕蠖蠡蠢蠲蠹蠼血衄衅行衍衔街衙衡衢衣补表衩衫衬衮衰衲衷衽衾衿袁袂袄袅袆袈袋袍袒袖袗袜袢袤袪被袭袯袱袼裁裂装裆裈裉裎裒裔裕裘裙裟裢裣裤裥裨裰裱裳裴裸裹裼裾褂褊褐褒褓褙褚褛褡褥褪褫褰褴褶襁襄襕襞襟襦襻西要覃覆见观规觅视觇览觉觊觋觌觎觏觐觑角觖觚觜觞解觥触觫觯觱觳言訄訇訾詈詹誉誊誓謇警譬计订讣认讥讦讧讨让讪讫训议讯记讲讳讴讵讶讷许讹论讼讽设访诀证诂诃评诅识诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩诫诬语诮误诰诱诲诳说诵请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谙谚谛谜谝谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豁豆豇豉豌豕豚象豢豨豪豫豳豸豹豺貂貅貉貊貌貔貘贝贞负贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赓赔赖赘赙赚赛赜赝赞赟赠赡赢赣赤赦赧赪赫赭走赳赴赵赶起趁趄超越趋趑趔趟趣趱足趴趵趸趺趼趾趿跃跄跆跋跌跎跏跐跑跖跗跚跛距跞跟跣跤跨跪跬路跳践跶跷跸跹跺跻跽踅踉踊踌踏踔踝踞踟踢踣踩踪踬踮踯踱踵踶踹踺踽蹀蹁蹂蹄蹅蹇蹈蹉蹊蹋蹐蹑蹒蹓蹙蹜蹢蹦蹩蹬蹭蹯蹰蹲蹴蹶蹼蹽蹾蹿躁躅躇躏躐躔躜躞身躬躯躲躺车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辛辜辞辟辣辨辩辫辰辱边辽达迁迂迄迅过迈迎运近迓返迕还这进远违连迟迢迤迥迦迨迩迪迫迭迮述迷迸迹追退送适逃逄逅逆选逊逋逍透逐逑递途逖逗通逛逝逞速造逡逢逦逭逮逯逵逶逸逻逼逾遁遂遄遇遍遏遐遑遒道遗遘遛遢遣遥遨遭遮遴遵遽避邀邂邃邈邋邑邓邕邗邙邛邝邡邢那邦邪邬邮邯邰邱邳邴邵邶邸邹邺邻邽邾郁郄郅郇郈郊郎郏郐郑郓郗郚郛郜郝郡郢郦郧部郫郭郯郴郸都郾郿鄂鄄鄌鄘鄙鄞鄢鄣鄯鄱鄹酃酆酉酊酋酌配酎酏酐酒酗酚酝酞酡酢酣酤酥酦酩酪酬酮酯酰酱酲酴酵酶酷酸酹酽酾酿醅醇醉醋醌醍醐醑醒醚醛醢醪醭醮醯醴醵醺醾采釉释里重野量金釜鉴銎銮鋆鋈錾鍪鎏鏊鏖鐾鑫钆钇针钉钊钋钌钍钎钏钐钒钓钔钕钗钘钙钚钛钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钷钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铌铍铎铐铑铒铕铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铧铨铩铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锎锏锐锑锒锓锔锕锖锗锘错锚锛锜锝锞锟锡锢锣锤锥锦锧锨锩锪锫锬锭键锯锰锱锲锴锵锶锷锸锹锻锽锾锿镀镁镂镃镄镅镆镇镈镉镊镋镌镍镎镏镐镑镒镓镔镖镗镘镚镛镜镝镞镠镡镢镣镤镥镦镧镨镩镪镫镬镭镯镰镱镲镳镴镵镶长门闩闪闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐阑阒阔阕阖阗阘阙阚阜队阡阢阪阮阱防阳阴阵阶阻阼阽阿陀陂附际陆陇陈陉陋陌降限陔陕陛陟陡院除陧陨险陪陬陲陴陵陶陷隅隆隈隋隍随隐隔隗隘隙障隧隰隳隶隼隽难雀雁雄雅集雇雉雌雍雎雏雒雕雠雨雩雪雯雳零雷雹雾需霁霄霆震霈霉霍霎霏霓霖霜霞霪霭霰露霸霹霾青靓靖静靛非靠靡面靥革靰靳靴靶靸靺靼靽靿鞁鞅鞋鞍鞑鞒鞘鞠鞡鞣鞧鞨鞫鞭鞯鞲鞴韂韦韧韨韩韪韫韬韭音韵韶页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颏颐频颓颔颖颗题颙颚颛颜额颞颟颠颡颢颤颥颦颧风飐飑飒飓飔飕飗飘飙飞食飧飨餍餐餮饔饕饥饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饿馀馁馃馄馅馆馇馈馉馊馋馌馍馏馐馑馒馓馔馕首馗馘香馥馨马驭驮驯驰驱驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骄骅骆骇骈骊骋验骍骎骏骐骑骒骓骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骧骨骰骶骷骸骺骼髀髁髂髅髋髌髑髓高髡髦髫髭髯髹髻鬃鬈鬏鬓鬟鬣鬯鬲鬹鬻鬼魁魂魃魄魅魆魇魈魉魍魏魑魔鱼鱽鱾鱿鲀鲁鲂鲃鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲔鲙鲚鲛鲜鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲷鲸鲹鲺鲻鲼鲽鲾鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳌鳍鳎鳏鳐鳑鳓鳔鳕鳖鳗鳘鳙鳚鳜鳝鳞鳟鳡鳢鳤鸟鸠鸡鸢鸣鸤鸥鸦鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹎鹏鹐鹑鹕鹗鹘鹚鹛鹜鹝鹞鹟鹠鹡鹣鹤鹦鹧鹨鹩鹪鹫鹬鹭鹮鹰鹱鹲鹳鹿麂麇麈麋麒麓麝麟麦麸麻麽麾黄黇黉黍黎黏黑黔默黛黜黝黟黠黢黥黧黩黯黹黻黼黾鼋鼍鼎鼐鼒鼓鼗鼙鼠鼢鼩鼫鼬鼯鼱鼷鼹鼻鼾齁齉齐齑齿龀龁龃龄龅龆龇龈龉龊龋龌龙龚龛龟龠";
	}
	else if ($set=="commonNotFrequent")
	{
		// sorted by unicode done 
		$a.="丕丞丫乂乜乩亍亓亘亟亢亨亳亵亶亸仂仃仄仉仕仞仟仡仨仫仳仵伉伋伎伛伢伥伧伫伽伾佐佗佘佚佝佞佟佤佥佬佯佰佴佶佻佼佾侃侉侏侑侔侗侩侪侬俅俎俑俚俜俞俟俣俦俨俪俳俵俶俸俾倌倏倓倜倞倥倨倩倪倬倭倻偃偈偌偕偬偲偻偾傈傣傥傧傩僇僖僦僬僭僮僰僳儆儇儋兀兕兖兮兹冁冉冢冥冱冼冽凇凋凼刈刍刎刖刭刳刿剀剁剅剌剐剕剜剞剟剡剽劁劂劐劓劢劬劭劾勍勐勖勩勰匍匏匐匜匝匡匦匮卅卉卞卟卣卮卯卺卻厄厍厝厣厥厩厮厾叟叩叱叵叻吡吣吲吾呃呋呓呔呖呗呙呤呦呱呲呶呷呸咀咂咄咋咎咔咚咛咝咣咤咦咩咫咭咯咴咻咿哂哇哉哌哏哐哓哔哕哙哚哝哞哦哧哳哽哿唏唑唔唛唝唢唣唪唳唷唼唿啁啉啐啕啖啜啧啪啬啭啮啴啵啶啷啻啾喀喁喃喈喋喏喑喔喙喟喤喱喵喹喽喾嗄嗉嗌嗍嗑嗒嗔嗖嗝嗞嗟嗣嗥嗨嗪嗫嗬嗯嗲嗳嗵嗷嗾嘈嘌嘎嘏嘘嘚嘛嘞嘟嘡嘣嘤嘧嘬嘭嘻噀噌噍噎噔噗噙噜噢噤噫噬噱噶噻噼嚄嚅嚆嚏嚓嚚嚯囔囝囟囡囫囵囹囿圄圉圊圜圩圪圬圭圮圯圳圹圻坂坌坍坜坨坩坫坭坳坻坼垅垆垌垍垓垞垟垠垡垣垤垧垩垭垯垱垲垸埏埒埔埕埘埙埚埝埭埯埴埸埼埽堇堉堋堌堍堑堙堞堠塃塄塆塈塍塥塬塮塾墀墁墈墉墒墟墦墼壅壑壬夔夙夤夥夬夼奁奂奎奘奚奭妁妃妊妍妗妞妣妤妩妪妫妮妯妲妾姒姗姘姝姞姣姬姹姽娅娆娈娉娌娑娓娟娠娣娥娲娴娼婀婊婕婞婢婧婪婳婵婷婺媛媪媲媵媸媾嫒嫔嫖嫘嫚嫜嫠嫣嫦嫪嫫嫱嬖嬗嬴嬷孀孑孓孚孛孜孢孥孪孬孰孱孳孺宄宓宕宥宬宸寅寐寤寮寰尕尜尥尧尬尴尹尻屃屐屙屣屦屺岈岌岍岐岑岘岙岚岢岣岫岬岱岵岷岿峁峂峄峋峒峙峣峤峥峧峨峪崂崃崆崛崞崟崤崦崮崴崽嵇嵊嵋嵎嵖嵘嵚嵛嵝嵩嵫嵬嵯嵴嶂嶓嶙嶝嶷巅巉巯巳巽帏帑帔帙帛帡帧帱帷帻帼幂幄幛幞幡幪幺庀庋庑庖庚庠庤庥庳庹庼庾廋廒廖廙廛廨廪廿弁弇弈弋弑弗弘弩弭弼彀彖彗彘彝彦彧彳彷徂徇徉徕徜徨徭徵徼忉忏忐忑忒忖忝忡忤忪忭忮忸忻忾怂怃怄怅怆怊怍怏怙怛怡怦怩怫怵怼怿恁恂恙恚恝恣恧恪恫恸恹恺恻恽恿悃悌悒悖悚悛悝悢悫悭悱悸悻惆惇惘惚惝惟惬惮惴惺愀愆愎愔愠愣愦愫慊慑慝慥慭慵憝憧憩憬憷懋懑懵懿戆戊戋戌戍戎戕戗戛戟戡戢戥戬戮戽戾扃扅扈扉扊扦扪扺抃抉抔抟抨抻抿拃拈拊拎拚拤拮拶拽挈挛挝挞挢挦挲挹捃捋捩捭捯掇掊掎掣掬掭掮掳掴掼掾揄揆揎揞揠揳揶揸揾揿搋搌搐搒搛搠搡搦搴搽摁摅摈摒摞摭摺摽撂撄撅撖撙撷撸撺擀擐擘擞擢擤攉攥攫攮攸敉敕敖敝敫斌斐斓斛斝斡斫於旃旄旆旌旎旒旖旮旯旰旸旻昀昃昉昊昕昝昱昴昶昽晁晏晔晖晗晞晟晡晢晷暄暅暌暝暧暨暹暾曈曛曜曝曦曩曰曳曷朊朐朔朕札杌杓杞杧杪杲杳杵杷杻杼枇枋枘枞枥枧枨枭枰枳枵枸柁柃柈柘柙柚柝柞柢柩柯柰柽栀栉栊栌栎栒栝栟栩栲栳栾桀桁桄桉桊桎桓桔桕桡桢桤桧桫桴桷梃梏梓梵梽梾棁棂棣棨棬棰棹棻棼椁椋椐椑椟椠椤椴椽楂楗楝楠楦楫楮楯楸楹榀榇榈榉榍榖榧榫榭榷榻槁槊槌槎槔槚槛槜槟槠槭槲槿樗樘樨樯樵樽樾橇橐橛橥橦橹橼檄檎檑檗檠檫檵欤欸歃歆歙殁殂殄殆殇殍殒殓殚殛殡殣殪殳毂毋毐毓毖毗毪毳毵毹毽氅氆氇氍氐氕氖氘氙氚氟氡氤氦氩氪氰氲氽汀汆汈汊汐汔汕汜汝汨汩汭汲汴汶汾沁沂沄沅沆沌沏沓沔沘沚沣沤沨沩沭沱泃泅泐泓泔泖泗泚泜泠泫泮泯泱泷泸泺泾洄洇洌洎洑洙洚洣洧洨洫洮洱洳洴洵洹洺浃浈浉浍浏浐浒浔浕浚浜浞浠浡浣浥浯浼涅涑涓涔涘涞涟涠涢涪涫涸涿淄淅淇淏淖淙淝淞淠淦淬渌渍渎渑渚渝渥渫渭渲湄湉湍湎湔湛湜湝湟湨湫湮湲溆溇溏溘溟溠溥溦溧溱溲溴溷溻溽滁滂滃滇滍滏滕滗滘滟滠滢滦滪滫滹漉漕漤漪漭漯漳漶潆潇潋潍潏潞潟潢潲潴潵潸潺潼潽澉澌澍澥澧澴澶澹澼濂濉濑濞濠濡濮濯瀌瀍瀚瀛瀣瀵瀹灏灞炀炅炔炖炙炜炝炟炯炱炳炷炻炽烀烃烊烜烝烨烩烬烯烷烺烽焉焌焐焓焖焘焜焯焱煅煊煜煦煨煲煳煸煺煽熘熜熠熥熨熵熹燊燏燔燠燧燮燹爝爨爰爻爿牁牂牒牖牚牝牟牦牮牯牾犄犊犋犍犏犒犟犨犰犴犷犸狁狃狄狉狍狎狒狙狝狨狩狯狲狳狴狷狺狻猁猃猄猊猕猗猝猞猡猢猥猱猷猸猹獍獐獒獗獠獬獭獯獴獾玎玑玕玙玚玠玡玢玥玦玮玳玺珀珂珈珉珏珐珑珙珞珣珥珧珩珰珲珽琇琎琏琚琛琤琥琦琨琪琫琬琮琯琰琵琶瑀瑁瑄瑕瑗瑙瑚瑛瑜瑢瑭瑶瑾璀璁璆璇璈璋璎璐璘璜璞璟璠璨璩璪瓒瓘瓞瓠瓯瓴瓻瓿甄甍甏甑甓甙甪甬甭町甾畀畈畋畎畚畛畯畲畹畿疃疍疔疖疝疠疡疢疣疥疬疭疰疱疳疴疵疸疽痂痃痄痈痉痍痔痞痣痤痦痧痨痫痱痼痿瘁瘃瘅瘆瘊瘌瘐瘗瘘瘙瘛瘠瘢瘥瘭瘰瘳瘴瘵瘼瘿癀癃癍癔癖癜癫癯癸皈皋皎皑皓皖皤皲皴盂盉盍盎盥盦盱眄眇眈眊眍眙眚眢眦眩眬眭眵眸眺睃睇睐睑睚睢睥睨睫睽睾睿瞀瞅瞌瞍瞑瞟瞠瞢瞥瞩瞰瞵瞽瞿矍矜矣矧矬矶矸矻矽砀砉砑砒砗砘砜砝砟砣砥砧砭砮砷砹砺砻砼硁硇硌硎硐硒硖硗硚硪硭硷碇碓碚碛碜碡碣碥碲碶碹磉磊磋磐磔磙磬磲磴磺礅礌礓礞礤礳礴祀祁祃祆祉祎祓祗祚祛祜祢祧祯祲祺祼祾禄禅禊禚禤禧禳禹禺秣秭秾稂稃稆稔稗稞稣稷穄穑穰穸穹窀窅窈窕窠窣窦窨窬窭窳窸竑竦竺竽笃笄笈笊笏笕笞笠笥笪笫笮笱笳笸笺笾筅筇筌筘筚筜筠筢筮筱筲筵筻筼箅箐箓箔箜箢箦箧箨箪箬箴箸篁篆篌篑篚篝篥篦篪篼篾簃簉簋簌簏簖簟簠簦簧簪籀籁籴籼粑粕粜粝粞粲粳粼粽糁糅糇糈糌糍糗糨糵絷綦綮縻繄繇纂纛纡纣纥纨纩纭纰纴纶纻纾绀绁绂绉绋绌绔绗绚绛绠绡绤绥绦绨绫绮绯绲绶绹绺绻绾缁缂缃缄缇缈缉缌缏缑缒缗缙缛缜缟缡缢缣缥缦缧缪缫缬缮缯缱缲缳缵缶罂罄罅罔罘罟罡罨罱罴罹罽罾羁羌羑羚羝羟羧羯羰羲羸羼羿翊翌翕翙翚翟翡翥翦翮翯翱翳耄耆耋耒耔耖耜耠耢耥耦耧耨耩耪耰耱耲耵耶耷聃聆聍聒聩聱聿肇肓肟肫肭肱肷肼肽胂胄胍胗胙胛胝胤胥胨胩胪胫胬胭胱胲胴胺胼脍脎脒脔脘脞脧脬脲脶腆腈腑腒腓腙腚腠腧腩腭腱腴腼腽膂膈膑膙膦膪膺膻臁臃臆臌臑臜臧臬臻臾舂舄舐舛舜舢舣舨舫舳舴舸舻舾艄艋艚艟艨艮艴艽艿芄芈芊芎芏芑芗芟芡芨芩芪芫芮芰芴芷芸芼芾苁苄苈苊苋苌苎苑苒苓苕苘苜苠苡苣苤苯苴苷苻茀茆茈茌茏茑茓茔茕茗茚茛茜茝茨茭茯茱茳茹茼荀荃荇荏荑荙荛荜荟荥荦荨荩荪荫荬荭荻荼荽莅莆莎莒莓莘莙莛莜莞莠莨莩莪莰莳莴莶莸莼菀菁菂菅菏菔菖菘菝菟菡菥菪菰菹菼菽萁萃萋萏萑萘萜萦萩萱萸萼葆葑葓葖葚葜葩葭葳葶葸葺蒇蒈蒉蒌蒎蒗蒟蒡蒯蒴蒹蒺蒽蓁蓂蓇蓊蓍蓐蓑蓓蓟蓠蓣蓥蓦蓰蓼蓿蔌蔟蔡蔷蔸蔹蔺蔻蕃蕈蕖蕙蕞蕤蕨蕰蕲蕹蕺蕻薅薏薜薤薨薮薰薷薹藁藉藓藜藠藩藿蘅蘖蘘蘧蘩蘼虔虞虢虬虮虺虻虼虿蚋蚍蚝蚧蚨蚩蚬蚰蚱蚴蚶蚺蛄蛊蛎蛏蛐蛑蛘蛞蛟蛩蛭蛰蛱蛲蛳蛴蛸蜃蜇蜉蜊蜍蜎蜚蜞蜢蜣蜥蜩蜮蜱蜴蜷蜾蜿蝈蝓蝣蝤蝥蝮蝰蝻蝼蝽蝾螂螅螈螋螗螠螣螨螫螬螭螯螳螵螽蟊蟑蟒蟛蟠蟪蟮蟾蠃蠊蠋蠓蠖蠡蠲蠹蠼衄衢衮衲衽衾衿袂袅袆袈袗袢袤袪袯袼裈裉裎裒裔裘裟裢裣裥裨裰裱裴裼裾褊褓褙褚褛褡褫褰褴褶襁襄襕襞襦襻覃觇觊觋觌觎觏觐觑觖觚觜觞觥觫觯觱觳訄訇訾詈詹謇讣讦讧讪讫讴讵讷诂诃诋诌诎诏诐诒诓诔诖诘诙诛诜诟诠诣诤诧诨诩诮诰诳诹诼诿谀谂谄谇谌谏谑谔谕谖谗谙谛谝谟谠谡谥谧谩谪谫谮谯谰谲谳谵谶豇豉豕豚豢豨豳豸貂貅貉貊貔貘贲贳贶贻贽赅赆赇赈赉赍赑赓赙赜赝赟赣赧赪赭赳趄趑趔趱趵趸趺趼趿跄跆跎跏跐跖跗跚跞跣跤跬跶跸跹跻跽踅踉踌踔踝踞踟踣踬踮踯踵踶踹踺踽蹀蹁蹅蹇蹉蹊蹐蹑蹒蹓蹙蹜蹢蹩蹯蹰蹴蹶蹼蹽蹾蹿躅躇躐躔躜躞轪轫轭轱轲轳轵轶轷轸轹轺轼轾辀辁辂辄辇辊辋辌辍辎辏辒辔辗辘辚迓迕迢迤迥迦迨迩迪迭迮迸逄逅逋逍逑逖逡逦逭逯逵逶遁遄遐遑遒遘遛遢遨遴遽邂邃邈邋邕邗邙邛邝邡邬邯邰邱邳邴邵邶邸邹邺邽邾郄郅郇郈郏郐郓郗郚郛郜郝郡郢郦郧郫郯郴郸郾郿鄂鄄鄌鄘鄞鄢鄣鄯鄱鄹酃酆酉酊酋酎酏酐酚酞酡酢酤酦酩酮酯酰酲酴酶酹酽酾醅醌醍醐醑醚醛醢醪醭醮醯醴醵醺醾釉釜銎銮鋆鋈錾鍪鎏鏊鏖鐾鑫钆钇钊钋钌钍钎钏钐钒钔钕钗钘钚钛钡钣钤钨钪钫钬钭钯钰钲钴钵钷钹钺钼钽钿铀铂铄铈铉铊铋铌铍铎铑铒铕铗铘铙铚铞铟铠铢铤铥铧铨铩铪铫铬铮铯铰铱铳铴铵铷铹铻铼铽铿锂锃锆锇锊锎锏锑锒锓锔锕锖锗锘锛锜锝锞锟锢锧锩锪锫锬锱锲锴锵锶锷锸锽锾锿镁镂镃镄镅镆镈镉镋镌镍镎镏镑镒镓镔镖镗镘镚镛镝镞镠镡镢镤镥镦镧镨镩镪镫镬镭镯镱镲镳镴镵闩闱闳闵闶闼闾闿阂阃阄阆阇阈阉阊阋阌阍阏阑阒阕阖阗阘阙阚阜阡阢阪阮阼阽陀陂陇陉陔陛陟陧陬陲陴隈隋隍隗隰隳隼隽雉雍雎雒雠雩雯霁霄霆霈霏霓霖霪霭霰霾靓靛靥靰靳靸靺靼靽靿鞁鞅鞑鞒鞘鞡鞣鞧鞨鞫鞯鞲鞴韂韦韨韪韫韬韶顸顼颀颃颉颋颌颍颏颐颔颙颚颛颞颟颡颢颥颦颧飐飑飓飔飕飗飙飧飨餍餮饔饕饧饨饩饪饫饬饯饳饴饷饸饹饻饽馀馃馄馇馈馉馊馌馐馑馓馔馕馗馘馥馨驭驵驷驸驺驽驿骀骁骅骈骊骋骍骎骐骒骓骖骘骙骛骜骝骞骟骠骢骣骥骧骰骶骷骸骺骼髀髁髂髅髋髌髑髡髦髫髭髯髹髻鬃鬈鬏鬟鬣鬯鬲鬹鬻魃魅魆魇魈魉魍魑鱽鱾鱿鲀鲂鲃鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲔鲙鲚鲛鲞鲟鲠鲡鲢鲣鲥鲦鲧鲨鲩鲪鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲷鲹鲺鲻鲼鲽鲾鳀鳁鳂鳃鳅鳆鳇鳈鳉鳊鳌鳎鳏鳐鳑鳓鳔鳕鳗鳘鳙鳚鳜鳝鳟鳡鳢鳤鸢鸤鸨鸩鸪鸫鸬鸮鸰鸱鸲鸶鸷鸸鸹鸺鸻鸼鸾鹀鹁鹂鹄鹆鹇鹈鹋鹌鹎鹐鹑鹕鹗鹘鹚鹛鹜鹝鹞鹟鹠鹡鹣鹧鹨鹩鹪鹫鹬鹭鹮鹱鹲鹳麂麇麈麋麒麓麝麟麽麾黇黉黏黛黜黝黟黠黢黥黧黩黯黹黻黼黾鼋鼍鼐鼒鼗鼙鼢鼩鼫鼬鼯鼱鼷鼹鼾齁齉齑龀龁龃龅龆龇龈龉龊龋龌龚龛龠";
	}
	else if ($set=="frequentNotHsk2") $a.=getHskV2CharList("frequentNotHsk2");
	else if ($set=="commonNotHsk2NorFrequent") $a.=getHskV2CharList("commonNotHsk2NorFrequent");
	else if ($set=="frequentNotHsk3") $a.=getHskV3CharList("frequentNotHsk3");
	else if ($set=="commonNotHsk3NorFrequent") $a.=getHskV3CharList("commonNotHsk3NorFrequent");
	else if ($set=="uncommon")
	{
		$a.="丨丶丿亅亠冂冖冫凵勹匚匸卩厶囗夂夊宀尢屮巛廴廾彐彡攴疋疒癶禸糸虍襾辵釆隹髟"; // radicals
		$a.="䒑丄丆乁乚乛亇亼𠂇𠃌𡿨氶辶妟卄刂㔾𠂆尣巜肀罒彑丩𠄌艹帀丬昜雚𫩏亽卬朩𢆉𫶧𠬶夋㣊咅侖𠕁𠀃豖丂";
		$a.="戉乇仌彥𫠠壴𠈌𠫓㕣尞夰𰀪𠔾𠮷𠃜𦣻𠤎弔𧈧丅冋𥃲𠁣𠃛䖝𢆶旲𧰨夃倝㐅嵒倠㐭菐僉吅氺丌奧𦈢㝉㝴匊円";
		$a.="昗劦豦朿垚凧㐱惢畐彔叚䏌𦍎睪巠枼咢𦉫匋夌啇叕怱肰镸翏祘𢀖㣎㝵𡰪蒦隻粦囬夅㐄𠬤龹咠𠃓𠮠𡰯厃坴";
		$a.="圥埶罙𠓜敄㡀荅丵𠂎𠂑卪𠀉㫗𬎿冏";
		$a.="々〇";
	}
	else if ($set=="traditional")
	{
		// traditional characters when the language code is zh-Hans
		// reference: https://zidian.qianp.com/zi/x where x is a character (Xinhua Zidian)
		// radicals
		$a.="戶見貝艸車長門靑韋頁風飛馬鬥魚鳥鹵麥黃黽齊齒龍龜";
		// hsk21 (only those that are not already above)
		$a.="愛氣電話點腦視東讀對兒飯館機鐘興個漢語後會幾開塊來師裡媽嗎買貓沒關係蘋錢請熱認識誰麼時書覺說歲聽學餵";
		$a.="們歡現寫謝習醫樣這國繫説";
		// hsk22 (only those that are not already above)
		$a.="為過還眞讓給別彆經從訴問錯間進幫動兩題離場錶邊準員備試體樂報遠運條務遊藥賣韆紅雞筆雖課紙貴陰紹賓顏籃";
		$a.="鉛";
		// hsk23 (only those that are not already above)
		$a.="發髮該當噹幹實應頭帶種記結難剛變總辦選決賽須單張萬聲護節願擔壞議禮數調業參復據簡輕滿靜極講戲終圖換檢";
		$a.="臉擇樓練歷顧畫聞腳詞輛雙響網園遲燒聰樹銀環爺燈褲盤陽較層鐵舊藍騎餓淨鮮掃慣郵綠鄰飲襯績煉傘飽鍛";
		// hsk25 (only those that are not already above)
		$a.="夾";
		// hsk26 (only those that are not already above)
		$a.="烏";
		// hsk31 (only those that are not already above)
		$a.="凈敎號麵";
		// hsk32 (only those that are not already above)
		$a.="佔億劃夠廣態涼溫牆確稱級組臟舉處裝複觀計討許論週適隊際隨雲順餃養髒";
		// hsk33 (only those that are not already above)
		$a.="並亂佈偉傳傷僅價儘優內創劇勝勢區圍團堅壓將專導屬幣廠強慶掛採斷標橋況湯濟煙煩營爭狀產眾礎積範紀約絕緊";
		$a.="線繼續義聯職華藝術衛補製規親訂訓訪設証評誌誤談證豬負責費資贏趕輸轉農連達鄉醣錄險雜預頓領類顯驗麗";
		// others
		$a.="";
	}
	else if ($set=="component")
	{
		$a.="⺀⺄⺆⺈⺊⺌⺕⺤⺥爫⻌⻍⻎丷乀亻攵氵覀龰龴龶龷𠂉𠂊𠂌𠂒𠃊𠃋𠃍𠃑𠄎𠆢𠘨𠦝𠫔𧘇𫢉𬺰𭕄扌犭忄牜灬衤";
		$a.="𤣩礻阝𫝀饣钅讠𥫗糹𠮛𬺻𢎨𢎥𪜊𰀁耂𡗗𥃭龸𰃮𤴓𦍌飠𧾷𠂋龵⺫𱼀𠀎𤴔⺳";
		// 罒 (net) != ⺫ (eye)
	}
	// zhHant, traditional characters when the language code is zh-Hant (in practice as in Taiwan)
	else if ($set=="t21") // corresponding traditional chars of hsk21 chars
	{
		// hsk21 traditional without those that are the same as hsk21 simplified
		// 愛氣電點腦飯機鐘興後幾來裡媽嗎貓係蘋錢熱認麼覺歲聽學餵們歡謝醫這國
		// openCC hsk21 conversion 2023-01-18, https://opencc.byvoid.com/ 簡體中文-繁體中文-臺灣標準-臺灣模式
		//$a.="我的你是了　不們這一他　麼在有個　好來人那會什沒說　嗎想能上去她很看對　裡　都子生時樣和下現做大怎出點　起天開謝些";
		  $a.="我的你是了瞭不們這一他么麼在有個箇好來人那會什沒說説嗎想能上去她很看對裏裡里都子生時樣和下現做大怎出點齣起天開謝些"; // discard 箇裏 from zh-Hans
		//$a.="家　後　兒多話小回　果見聽覺太媽打再呢女前先明中作面愛　　電哪西候歡關車年喜認爸誰老機分今工東名同　學叫本國友高";
		  $a.="傢家后後兒多話小回迴果見聽覺太媽打再呢女前先明中作面愛麪麵電哪西候歡關車年喜認爸誰老機分今工東名同衕學叫本國友高"; // discard 齣傢迴麪衕麵 from zh-Hans
		//$a.="請住錢吃朋系　　　幾氣少醫三興服字水號師星識坐期買影二喝月寫姐飛視衣鍾　　十睡亮狗腦院書四米校客歲　　五漂喂　塊店語";
		  $a.="請住錢喫朋系係繫几幾氣少醫三興服字水號師星識坐期買影二喝月寫姐飛視衣鍾鈡鐘十睡亮狗腦院書四米校客嵗歲𡻕五漂喂餵塊店語"; // discard: 鈡喫號鍾嵗𡻕餵 from zh-Hans
		//$a.="熱杯　昨飯冷午習六讀商八漢租貓七菜北桌雨九椅茶京　蘋";
		  $a.="熱杯盃昨飯冷午習六讀商八漢租貓七菜北桌雨九椅茶京苹蘋"; // discard: 盃 from zh-Hans
	}
	else if ($set=="t22") // corresponding traditional chars of hsk22 chars
	{
		// hsk22 traditional without those that are the same as hsk22 simplified
		//$a.="為過還眞讓給別彆經從訴問錯間進幫動長兩題離場錶邊準員備試體樂門報敎遠運條";
		//$a.="務遊葯藥賣牀韆紅魚舘館雞鷄筆雖課紙貴陰纍紹賓顏顔籃鉛";
		// openCC hsk22 conversion 2023-01-18, https://opencc.byvoid.com/ 簡體中文-繁體中文-臺灣標準-臺灣模式
		//$a.="要就到為道可知得過吧還以事也真讓給但著意別　所然走經因告最手找快等從情訴已問錯孩它間次正進比幫晚動常";
		  $a.="要就到為道可知得過吧還以事也眞讓給但着意別彆所然走經因告最手找快等從情訴已問錯孩它間次正進比幫晚動常"; // discard from zh-Hant: 爲
		//$a.="長白第兩非公身題完望離新思場始外件表　希邊男　準員玩每備試體樂早門房球夫路日舞笑報教色遠眼蛋息室運哥火";
		  $a.="長白第兩非公身題完望離新思場始外件表錶希邊男准準員玩每備試體樂早門房球夫路日舞笑報教色遠眼蛋息室運哥火"; // discard from zh-Hant: 敎
		//$a.="條病弟您送近穿助司跑忙站跳便歌務黑票遊　唱考往步班藥賣百妹足慢妻床休洗奶千　共懂介紅魚牛館肉旅雞丈睛筆";
		  $a.="條病弟您送近穿助司跑忙站跳便歌務黑票遊游唱考往步班藥賣百妹足慢妻床休洗奶千韆共懂介紅魚牛館肉旅雞丈睛筆"; // add 床, discard from zh-hant: 葯牀舘
		//$a.="雖啡課咖紙左右旁雪貴汽瓜陰累紹踢賓泳零羊顏姓籃宜鉛晴";
		  $a.="雖啡課咖紙左右旁雪貴汽瓜陰累紹踢賓泳零羊顏姓籃宜鉛晴"; // discard from zh-hant: 鷄纍顔
	}
	else if ($set=="t23") // corresponding traditional chars of hsk23 chars
	{
		// hsk23 simplified for reference
		//$a.="啊把只如自发心定该当用地行而像被跟成感干法己信实方应头特相需放直才于带力种者安理重记加接拿解其又更马";
		//$a.="结难位刚查或变物总办主算必害选且向照提决求目留清世片口酒周赛须卡婚根单张万声音奇怕护花节怪愿除界担空";
		//$a.="阿注坏久议礼数平调文业包参风复忘假据嘴越简易答乎超轻满静故极讲趣戏容化束终差图半楚市城换船级刻迎段检";
		//$a.="脸择楼皮练历山元角街料板顾遇史画闻急糕脚聊居词突努辆句季双牙南冰响网箱园冒甜香叔搬迟烧借聪腿鞋树银短";
		//$a.="环哭康般境爷灯裤盘附阳健较耳草层末铁黄夏舒旧蓝疼河鸟骑饿瓶典育净李鲜扫惯邮帽啤梯鼻绿熊胖爬邻春朵饮裙";
		//$a.="澡渴衫刷衬姨秋碗绩冬刮瘦矮炼伞饱锻蕉斤筷";
		// hsk23 traditional without those that are the same as hsk23 simplified
		//$a.="發髮該當噹幹實應頭於帶種記馬結難剛變總辦選決賽須單張萬聲護節願擔壞議禮數調業參復風據簡輕滿靜極講戲終圖";
		//$a.="換級檢臉擇樓練歷顧畫聞腳詞輛雙響網園遲燒聰樹銀環爺燈褲盤陽較層鐵黃舊藍鳥騎餓淨鮮掃慣郵綠鄰飲襯績煉傘飽";
		//$a.="鍛";
		//$a.="乾纔査嚮曏週鬚註蔘複覆厤曆闆畵藉凈緑鞦鼕颳鍊";
		// discard 祇(只)衹(只)隻(只)榦(干乾幹)
		// openCC hsk23 convertion 2023-01-17, https://opencc.byvoid.com/ 簡體中文-繁體中文-臺灣標準-臺灣模式
		//$a.="啊把只如自發　心定該當　用地行而像被跟成感幹法己信實方應頭特相需放直才於帶力種者安理重記加接拿解其又更馬";
		  $a.="啊把只如自發髮心定該當噹用地行而像被跟成感幹法己信實方應頭特相需放直才於帶力種者安理重記加接拿解其又更馬";
		//$a.="結難位剛查或變物總辦主算必害選且向照提決求目留清世片口酒周賽須卡婚根單張萬聲音奇怕護花節怪願除界擔空";
		  $a.="結難位剛查或變物總辦主算必害選且向照提決求目留清世片口酒周賽須卡婚根單張萬聲音奇怕護花節怪願除界擔空";
		//$a.="阿注壞久議禮數平調文業包參風復忘假據嘴越簡易答乎超輕滿靜故極講趣戲容化束終差圖半楚市城換船級刻迎段檢";
		  $a.="阿注壞久議禮數平調文業包參風復忘假據嘴越簡易答乎超輕滿靜故極講趣戲容化束終差圖半楚市城換船級刻迎段檢";
		//$a.="臉擇樓皮練歷山元角街料板顧遇史畫聞急糕腳聊居詞突努輛句季雙牙南冰響網箱園冒甜香叔搬遲燒借聰腿鞋樹銀短";
		  $a.="臉擇樓皮練歷山元角街料板顧遇史畫聞急糕腳聊居詞突努輛句季雙牙南冰響網箱園冒甜香叔搬遲燒借聰腿鞋樹銀短";
		//$a.="環哭康般境爺燈褲盤附陽健較耳草層末鐵黃夏舒舊藍疼河鳥騎餓瓶典育淨李鮮掃慣郵帽啤梯鼻綠熊胖爬鄰春朵飲裙";
		  $a.="環哭康般境爺燈褲盤附陽健較耳草層末鐵黃夏舒舊藍疼河鳥騎餓瓶典育淨李鮮掃慣郵帽啤梯鼻綠熊胖爬鄰春朵飲裙";
		//$a.="澡渴衫刷襯姨秋碗績冬刮瘦矮煉傘飽鍛蕉斤筷";
		  $a.="澡渴衫刷襯姨秋碗績冬刮瘦矮煉傘飽鍛蕉斤筷";
	}
	else if ($set=="t24") // corresponding traditional chars of hsk24 chars
	{
	}
	else if ($set=="t25") // corresponding traditional chars of hsk25 chars
	{
	}
	else if ($set=="t26") // corresponding traditional chars of hsk26 chars
	{
	}
	// method to build t3 lists
	// - build the list t3n (where n is the level) with makeZhHantFromZhHans.php script
	// - translate the hsk3n words in traditional with any translator online
	// - cross check the two lists above, discard variant characters not in use in t3n
	// - move provisionally variant characters not in use in t3n but in use in another t3m to t3nVariants
	// - move variant characters present in taiwan4808 but not present in hsk v3 to taiwan4808NotT3
	// - move variant characters not present in taiwan4808 but present in hsk v3 to t3NotTaiwan4808
	// - move other variant characters to tu or discard them
	else if ($set=="t31") // corresponding traditional chars of hsk31 chars
	{
		// postponed (svg not available and rare use)
		// 鷄(雞) not in taiwan4808
		// 牀(床) not in taiwan4808
		// 纍(累) in taiwan4808 (5232 in frequency)
		// moved in t31Variants (provisionally)
		//	傢(家) seen in hsk26 家伙/傢伙
		//	迴(回) seen in hsk36 回避/迴避
		//	壞(坏) seen in hsk33 破坏/破壞
		//	幹(乾干) seen in hsk32 干活儿/幹活兒
		//	里(里) in taiwan4808 seen in hsk32 公里? (it is 裡 in t31, not 里)
		//	系(系) in taiwan4808 (149 in frequency?) (it is 係 in t31, not 系)
		//	干(干) in taiwan4808 (1386 in frequency) (it is 乾 in t31, not 干)
		//	准(准) in taiwan4808 (1519 in frequency) (準 is used in t31, not 准)
		//	汽(汽) seen in 公共汽车 hsk32 (氣 is used in t31, not 汽)
		//	繫(系) seen in hsk33 关系/關係
		//	箇(个) not seen in hsk1-6? in taiwan4808 (4355 in frequency)
		//  齣(出) in taiwan4808 (2802 in frequency)
		//	盃(杯) in taiwan4808 (1719 in frequency)
		//	彆(别) seen in 别扭/彆扭
		// moved in frequentNotHsk3
		//	瞭(了) is sometimes simplified as 了, but is also a simplified frequentNotHsk3 character
		//		remove it from t31, will be add in the corresponding set of the simplified 瞭
		// moved in tu (not in taiwan4808)
		//	榦(乾干), 嵗(歲), 𡻕(歲), 眞(真), 衕(同), 麪(面), 裏(里), 喫(吃), 舘(馆)
		// note:
		//	説(说) not used in TW (說 is commonly used), but commonly used in HK, so keep it in t31
		// sorted by unicode done
		$a.="一七三上下不中么九也乾了事二五些京人什今介他休住作你來係個們候假做備元先兒兩八六再冷凈几出分別到前動包北十午半南去友口叫右同名后吧告呢和哥哪唱商問喜喝嗎四回國圖在地坐場塊外多大天太女奶她好妹姐媽子字孩學客家寫對小少就山工左差師常幫年幾店弟影很後得從忘忙快怎息您想愛慢我房手打找拿放敎文新方旁日早明星昨是時晚書最會月有朋服期本杯東果校桌條樓樣樹機次歌歡正歲比毛氣水沒洗淨渴準漢火熱爸爺牛玩班現球生用男病白百的看着睡知票穿站笑第等答米累紹給網習老考聽肉能腦興花茶菜號蛋行衣裡西要見視覺記訴試話認語說誰課請謝識讀貴買走起跑跟路身車送這進過道遠還邊那都醫重錢錯門開間關院雞難雨零電非面頁風飛飯餓館馬體高麵麼點";
	}
	else if ($set=="t32") // corresponding traditional chars of hsk32 chars
	{
		// postponed (not in taiwan4808 and not yet in svgsZhHant)
		// 爲畵确 万墻广曏査緑纔葯蔘衹适顔
		// postponed (in taiwan4808 but not yet in svgsZhHant nor in t32)
		// 于 (於 in t32), 云 (雲 in t32), 剋 (克 in t32), 占 (佔 in t32), 鼕 (冬 in t32)
		// 鞦 (秋 in t32), 鼕 (冬 in t32)
		// moved to t32Variants
		// 鬚愿喂
		// moved to taiwan4808NotT3
		// 祇(只 in t32) 韆 (千 in t32)
		// moved to tu (not in taiwan4808 but already in svgsZhHant)
		// 鈡
		// added
		// 交份低佔使例倒停億克 入全划利劃印原取受 合吹味咱喊嚮堂夜夠套 封度座庭廣弄忽愿態拉 挺掉排推收改晨普永油
		// 活流海涼湖溫熟牆由省 碰確示科稱篇組背臟 舉英藉處裝複覆觀言計 討許論通週遍適部量閤 闆隊際隨隻雲青靠順食
		// 餃養餐 髒鬚
		// moved from t31Variants to t32
		// 里
		// sorted by unicode done
		$a.="且主久交亮以件份但位低佔使例便信倒借停健像億克入全公共其典冬利刻剛劃力加助努務千卡印原參又取受句只可司合向吹味咱哭啊喊單嘴因園堂報夏夜夠套如姓它安完定宜室實封層己已市帶平度座庭康廣弄往心必忽怕思急情意感態慣懂應成或所才拉挺掉排接推提換收改故數斤於旅春晨普晴更末板查椅楚業樂檢段永求河油法活流海涼清湖溫滿漂澡為然照熟燈爬牆片物特狗理瓶由留畫當疼發目直相省眼睛短碗碰確示禮秋科租稱空筆筷算節篇籃紅紙級組結經綠練績者而聞聲育背腳腿臉臟自舉舒般船色英草萬藍藥處街裝複觀角言計討許詞該論講護變讓貓賣超越輕輛辦迎近通週遊運遍適選部酒里量銀錶鐘鐵長陰陽隊際隨雖離雪雲青靜靠鞋音響順須頭題顏願顧食飽餃養餐餵騎髒髮魚鳥黃黑";
	}
	else if ($set=="t33") // corresponding traditional chars of hsk33 chars
	{
		//added:
		//並丰亂互仍付代似 佈何保修值偉傳傷僅價 儘優充光內具刀切初 判制創劇功勝勢區升 危及反古另台各否吵命
		//品哈善器困圍 團土基堅增壓失 姑娘媒存宣 富察將專導屋展屬巧布 幣幸底廠建式強形
		//彩待志念性恐慶批 技抓拍持指按掛採握 播支效救敢散整斷 族景暖曾朝木材 村架某格概標橋
		//止此武死母民汁 沙況洞派浪消深 湯演濟烈煙煩營爭父牌 狀產痛眾石破 礎社祝神福程積立
		//章管範精紀約絕 緊線繼續缺美群義 聯職至苦華落 藝血術衛補製 規親訂訓訪設証
		//評誌誤談證警象豬 負責費資贏趕 輸轉農迷追退速造連達 鄉配醣金錄防險集 雜預頓領類顯首
		//驗麗麻齊龍
		// sorted by unicode done
		$a.="世並丰亂互仍付代任似佈何保修值偉傳傷僅價儘優充光內具冒刀切初判制創劇功勝勢化區升危及反古另台各否吵命咖品哈員啡啤善器困圍團土城基堅境增壓夫失奇始姑娘婚媒存宣害容富察將專導屋展屬巧布希幣幸底廠建式張強形彩待志念性怪恐慶戲批技把抓拍持指按掛採握搬播據支效救敢散整斷族易景暖曾望朝木李材村束架某根格極概標橋止此步武歷死母每民汁決沙況注泳洞派浪消深湯演濟烈煙煩營爭父牌狀環甜產界痛皮眾石破礎社祝神福程種積突立章管箱範簡精紀約終絕緊線總繼續缺羊美群義聯職胖至舊舞苦華落蕉藝蘋血術衛衫被裙補製褲襯規親解訂訓訪設証評誌誤調談證警議象豬負責費資賽贏趕足跳較輸轉農迷追退速造連達郵鄉配醣金錄防除險集雙雜需預頓領類顯首香驗麗麻齊龍";
	}
	else if ($set=="t34") // corresponding traditional chars of hsk34 chars
	{
	}
	else if ($set=="t35") // corresponding traditional chars of hsk35 chars
	{
	}
	else if ($set=="t36") // corresponding traditional chars of hsk36 chars
	{
	}
	else if ($set=="t37") // corresponding traditional chars of hsk37 chars
	{
	}
	else if ($set=="t38") // corresponding traditional chars of hsk38 chars
	{
	}
	else if ($set=="t39") // corresponding traditional chars of hsk39 chars
	{
	}
	else if ($set=="t31Variants") // variants of t31 characters, not in t31 but in hsk3
	{
		// traditional forms not used in level 1 of simplified hanzi used in level 1
		// should be move in another txx set when it will be completed
		// move 里 to t32)
		$a.="傢迴壞幹系繫箇齣准盃彆干汽";
		// variant commonly used in HK
		$a.="説";
	}
	else if ($set=="t32Variants") // variants of t32 characters, not in t32 but in hsk3
	{
		// traditional forms not used in level 2 of simplified hanzi used in level 2
		// should be move in another txx set when it will be completed
		$a.="鬚愿喂";
	}
	else if ($set=="t33Variants") // variants of t33 characters, not in t33 but in hsk3
	{
	}
	else if ($set=="taiwan4808NotT3") // uncommon in taiwan4808, not in hsk v3 up to level 6
	{
		$a.="瞭"; // from t31
		$a.="祇"; // from t32
		$a.="菸"; // from t33
		$a.="扉斐韆"; // not at all in hsk v3?
	}
	else if ($set=="t3NotTaiwan4808")
	{
		$a.="丰佈"; // t33
	}
	else if ($set=="tu") // uncommon not in taiwan4808
	{
		$a.="丨丶丿亅亠儿厂广龠";
		$a.="榦嵗𡻕眞衕麪裏喫舘"; // variants of t31
		$a.="鈡"; // variants of t32
		$a.="々〇";
	}
	else if ($set=="tc")
	{
		$a.="忄艹";
	}
	// taiwan (included in zhHant as is)
	else if ($set=="taiwan4808") $a.=getTaiwan4808CharList();
	// ko
	else if (preg_match("/^hanja[1-9]$/",$set)) $a.=getHanjaByLevelCharList($set);
	else if ($set=="hangul") $a.=getHangulCharList();
	else if ($set=="hanguljamos") $a.=getHangulJamosCharList();
	else if ($set=="hangulsyllables") $a.=getHangulSyllablesCharList();
	else if ($set=="hanja1800a") $a.=getHanja1800aCharList();
	else if ($set=="hanja1800b") $a.=getHanja1800bCharList();
	else if ($set=="hanja1800") $a.=getHanja1800aCharList().getHanja1800bCharList();
	else if ($set=="ku") $a.=getUncommonHanjaCharList();
	else if ($set=="kc") $a.=getHanjaComponentsCharList();
	else if ($set=="radicals")
	{
		// 214 radical official list (not the same unicode as those commonly used)
		//$a="⼀⼁⼂⼃⼄⼅⼆⼇⼈⼉⼊⼋⼌⼍⼎⼏";
		//$a.="⼐⼑⼒⼓⼔⼕⼖⼗⼘⼙⼚⼛⼜⼝⼞⼟";
		//$a.="⼠⼡⼢⼣⼤⼥⼦⼧⼨⼩⼪⼫⼬⼭⼮⼯";
		//$a.="⼰⼱⼲⼳⼴⼵⼶⼷⼸⼹⼺⼻⼼⼽⼾⼿";
		//$a.="⽀⽁⽂⽃⽄⽅⽆⽇⽈⽉⽊⽋⽌⽍⽎⽏";
		//$a.="⽐⽑⽒⽓⽔⽕⽖⽗⽘⽙⽚⽛⽜⽝⽞⽟";
		//$a.="⽠⽡⽢⽣⽤⽥⽦⽧⽨⽩⽪⽫⽬⽭⽮⽯";
		//$a.="⽰⽱⽲⽳⽴⽵⽶⽷⽸⽹⽺⽻⽼⽽⽾⽿";
		//$a.="⾀⾁⾂⾃⾄⾅⾆⾇⾈⾉⾊⾋⾌⾍⾎⾏";
		//$a.="⾐⾑⾒⾓⾔⾕⾖⾗⾘⾙⾚⾛⾜⾝⾞⾟";
		//$a.="⾠⾡⾢⾣⾤⾥⾦⾧⾨⾩⾪⾫⾬⾭⾮⾯";
		//$a.="⾰⾱⾲⾳⾴⾵⾶⾷⾸⾹⾺⾻⾼⾽⾾⾿";
		//$a.="⿀⿁⿂⿃⿄⿅⿆⿇⿈⿉⿊⿋⿌⿍⿎⿏";
		//$a.="⿐⿑⿒⿓⿔⿕";
		// 214 radical list (commonly used unicode)
		// 靑/青: use 靑 (coherent with 黃黍...)? 
		$a="一丨丶丿乙亅二亠人儿入八冂冖冫几";
		$a.="凵刀力勹匕匚匸十卜卩厂厶又口囗土";
		$a.="士夂夊夕大女子宀寸小尢尸屮山巛工";
		$a.="己巾干幺广廴廾弋弓彐彡彳心戈戶手";
		$a.="支攴文斗斤方无日曰月木欠止歹殳毋";
		$a.="比毛氏气水火爪父爻爿片牙牛犬玄玉";
		$a.="瓜瓦甘生用田疋疒癶白皮皿目矛矢石";
		$a.="示禸禾穴立竹米糸缶网羊羽老而耒耳";
		$a.="聿肉臣自至臼舌舛舟艮色艸虍虫血行";
		$a.="衣襾見角言谷豆豕豸貝赤走足身車辛";
		$a.="辰辵邑酉釆里金長門阜隶隹雨靑非面";
		$a.="革韋韭音頁風飛食首香馬骨高髟鬥鬯";
		$a.="鬲鬼魚鳥鹵鹿麥麻黃黍黑黹黽鼎鼓鼠";
		$a.="鼻齊齒龍龜龠";
	}
	else if ($set=="stroke")
	{
		// strokes, not chars nor components
		$a.="㇀㇁㇂㇃㇄㇅㇆㇇㇈㇉㇊㇋㇌㇍㇎㇏㇐㇑㇒㇓㇔㇕㇖㇗㇘㇙㇚㇛㇜㇝㇞㇟㇠㇡㇢";
	}
	// groups (start with an uppercase), contain all and only verified characters
	else if($set=="Kana") $a.=getCharList("hiragana").getCharList("katakana");
	else if($set=="Joyo") for($k=1;$k<8;$k++) $a.=getCharList("g".$k);
	else if($set=="Hsk2") for($k=1;$k<7;$k++) $a.=getCharList("hsk2".$k);
	else if($set=="Hsk3") for($k=1;$k<10;$k++) $a.=getCharList("hsk3".$k);
	else if($set=="Ja")
	{
		for($k=1;$k<10;$k++) $a.=getCharList("g".$k);
		$a.=getCharList("gc");
		$a.=getCharList("stroke");
	}
	else if($set=="Ko")
	{
		for($k=8;$k>0;$k--) $a.=getHanjaByLevelCharList("hanja".$k);
		$a.=getCharList("ku");
		$a.=getCharList("kc");
	}
	else if($set=="ZhHans")
	{
		$a.=getCharList("common7000");
		$a.=getCharList("uncommon");
		$a.=getCharList("traditional");
		$a.=getCharList("component");
		$a.=getCharList("stroke");
	}
	else if($set=="ZhHant")
	{
		for($k=1;$k<10;$k++) $a.=getCharList("t3".$k);
		for($k=1;$k<10;$k++) $a.=getCharList("t3".$k."Variants"); // provisional
		$a.=getCharList("taiwan4808NotT3");
		$a.=getCharList("tu");
		$a.=getCharList("tc");
	}
	return $a;
}
?>